alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
/*!
 * @file OpenFIRE_Wireless.cpp
 * @brief Library for OpenFIRE wireless with Esp-Now
 * @n CPP Library for OpenFIRE wireless with Esp-Now
 *
 * @copyright alessandro-satanassi, https://github.com/alessandro-satanassi, 2026
 * @copyright GNU Lesser General Public License
 *
 * @author [Alessandro Satanassi](alessandro@cittini.it)
 * @version V1.0
 * @date 2026
 */

#if defined(OPENFIRE_WIRELESS_ENABLE) && defined(ARDUINO_ARCH_ESP32)

#include "OpenFIRE_Wireless.h"
#include "esp_idf_version.h"

// ===================================================================================
// ROLE DEPENDENT HARDWARE INITIALIZATION / INIZIALIZZAZIONE HARDWARE DIPENDENTE DAL RUOLO (GUN vs DONGLE)
// ===================================================================================
// We selectively include display drivers based on the build target
// (#ifdef DONGLE or #ifdef GUN) to save precious space on Flash memory
// and do not load graphics libraries on devices that do not have them.
// /
// Includiamo selettivamente i driver del display in base al target di compilazione
// (#ifdef DONGLE o #ifdef GUN) per risparmiare prezioso spazio sulla memoria Flash
// e non caricare librerie grafiche su dispositivi che ne sono sprovvisti.

#ifdef DONGLE
  #ifdef USES_DISPLAY
    #ifdef USE_LOVYAN_GFX
      #define LGFX_USE_V1
      #include <LovyanGFX.hpp>
      #include "LGFX_096_ST7735S_80x160.hpp"
      extern LGFX tft;
      #define WHITE            TFT_WHITE
      #define BLACK            TFT_BLACK
      #define BLUE             TFT_BLUE
      #define RED              TFT_RED
      #define MAGENTA          TFT_MAGENTA
      #define GREEN            TFT_GREEN
      #define CYAN             TFT_CYAN
      #define YELLOW           TFT_YELLOW
      #define BROWN            TFT_BROWN
      #define GRAY             TFT_LIGHTGRAY
      #define ORANGE           TFT_ORANGE
    #else
      #include <Adafruit_ST7735.h>
      extern Adafruit_ST7735 tft;
      #define WHITE            ST7735_WHITE
      #define BLACK            ST7735_BLACK
      #define BLUE             ST7735_BLUE
      #define RED              ST7735_RED
      #define MAGENTA          ST7735_MAGENTA
      #define GREEN            ST7735_GREEN
      #define CYAN             ST7735_CYAN
      #define YELLOW           ST7735_YELLOW
      #define BROWN            0XBC40
      #define GRAY             0X8430
      #define ORANGE           ST7735_ORANGE
    #endif // USE_LOVYAN_GFX
  #endif // USES_DISPLAY
#endif // DONGLE

#ifdef GUN
  #ifdef USES_DISPLAY
    // #include "../../src/OpenFIREdisplay.h"
    // #include "../../src/OpenFIREcommon.h"
    #ifdef USE_LOVYAN_GFX
      #include <LovyanGFX.hpp>
      #include "LGFX_096_SSD1306_64x128.hpp"
      extern LGFX_SSD1306 *&display_OLED;
    #else
      #include <Adafruit_SSD1306.h>
      extern Adafruit_SSD1306 *&display_OLED;
      //extern ExtDisplay OLED;
    #endif // USE_LOVYAN_GFX
  #endif // USES_DISPLAY
#endif // GUN

extern bool display_init;


// ===================================================================================
// ESP-NOW Configuration and Global Variables / CONFIGURAZIONE ESP-NOW E VARIABILI GLOBALI
// ===================================================================================

#ifndef OPENFIRE_ESPNOW_WIFI_CHANNEL
  #define OPENFIRE_ESPNOW_WIFI_CHANNEL 11 // default channel for the light gun  / canale sul quale si sintonizza la lightgun di default
#endif // OPENFIRE_ESPNOW_WIFI_CHANNEL

#ifndef OPENFIRE_ESPNOW_WIFI_POWER
  // transmit power can range from 8 to 84, where 84 is the maximum value corresponding to 21 dB (x4) / la potenza di trasmissione può andare da 8 a 84, dove 84 è il valore massimo che corrisponde a 21 db (x4)
  // #define OPENFIRE_ESPNOW_WIFI_POWER WIFI_POWER_15dBm  // corresponds to 60... more conservative power but with an excellent signal / corrisponde a 60 .. potenza più conservativa ma con segnale eccellente
  #define OPENFIRE_ESPNOW_WIFI_POWER WIFI_POWER_17dBm  // corresponds to 68... maximum power without distortion and with an excellent signal / corrisponde a 68 .. massima potenza senza distursioni con segnale eccellette
  
#endif //OPENFIRE_ESPNOW_WIFI_POWER

uint8_t espnow_wifi_channel = OPENFIRE_ESPNOW_WIFI_CHANNEL;  // Configurable for future setup via app or OLED. / FATTA VARIABILE PER FUTURA CONFIGURAZIONE TRAMITE APP O OLED
uint8_t espnow_wifi_power = OPENFIRE_ESPNOW_WIFI_POWER;      // Configurable for future setup via app or OLED. / FATTA VARIABILE PER FUTURA CONFIGURAZIONE TRAMITE APP O OLED

// HID SHADOW STATE: We maintain a local copy of the last state sent to the PC.
// We update the USB host *only* when this data changes, avoiding saturating
// the USB endpoint with unnecessary polling.
// /
// SHADOW STATE HID: Manteniamo una copia locale dell'ultimo stato inviato al PC.
// Aggiorniamo l'host USB *solo* quando questi dati cambiano, evitando di saturare
// l'Endpoint USB con polling inutili.
hid_abs_mouse_report_t absmouse5Report_last_wifi = {0,0,0,0,0};
hid_keyboard_report_t  keyReport_last_wifi = {0,0,{0,0,0,0,0,0}};
hid_gamepad16_report_t gamepad16Report_last_wifi = {0,0,0,0,0,0,0,0};

volatile bool absmouse5Report_pending = false; 
volatile bool keyReport_pending = false;
volatile bool gamepad16Report_pending = false;

// SPOOFING USB: 
// Default dongle data, which will be overwritten by the Lightgun's
// data during the handshake to fool the OS.
// /
//Dati di default del Dongle, che verranno sovrascritti dai dati della
// Lightgun durante la negoziazione (Handshake) per ingannare il SO.
USB_Data_GUN_Wireless usb_data_wireless = {
  "OpenFIRE_DONGLE",  // MANIFACTURES
  "FIRECon",          // NAME
  0xF143,             // VID
  0x1998, // 0x0001   // PID
  1,                  // PLAYER
  espnow_wifi_channel
  //OPENFIRE_ESPNOW_WIFI_CHANNEL // CHANNEL
  //,""               // 
};

SerialWireless_ SerialWireless;
extern Adafruit_USBD_HID usbHid;

// Spinlocks (Hardware Mutexes): Essential for ensuring that reads and writes
// to circular buffers are never interrupted mid-operation by tasks on different cores
// or by WiFi interrupts, preventing fatal RAM corruption.
// /
// Spinlocks (Mutex Hardware): Fondamentali per garantire che letture e scritture
// sui buffer circolari non vengano mai interrotte a metà da task su core diversi 
// o da interrupt WiFi, prevenendo la corruzione letale della RAM.
static portMUX_TYPE mux_serial_tx = portMUX_INITIALIZER_UNLOCKED;
static portMUX_TYPE mux_radio_tx = portMUX_INITIALIZER_UNLOCKED;


uint8_t buffer_espnow[ESP_NOW_MAX_DATA_LEN];
esp_now_peer_info_t peerInfo; // It must be placed outside the functions—a global utility variable for configuration. / deve stare fuori funzioni da funzioni -- globale --variabile di utilità per configurazione

