alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
static void _esp_now_rx_cb(const esp_now_recv_info_t *info, const uint8_t *data, int len); // callback esp_now
static void _esp_now_tx_cb(const esp_now_send_info_t *tx_info, esp_now_send_status_t status);

#ifdef COMMENTO
#if ESP_IDF_VERSION_MAJOR == 5 && ESP_IDF_VERSION_MINOR <= 4
  // Code for versions up to 5.4 / Codice per versioni fino alla 5.4
  static void _esp_now_tx_cb(const uint8_t *mac_addr, esp_now_send_status_t status); // callback esp_now
#elif ESP_IDF_VERSION_MAJOR > 5 || (ESP_IDF_VERSION_MAJOR == 5 && ESP_IDF_VERSION_MINOR >= 5)
  // Code for versions 5.5 or higher / Codice per versioni 5.5 o superiori
  static void _esp_now_tx_cb(const esp_now_send_info_t *tx_info, esp_now_send_status_t status); // callback esp_now // for the new IDF 55 version / poer nuova versione IDF 55
#endif
#endif // COMMENTO

void packet_callback_read_dongle(); // callback packet 
void packet_callback_read_gun(); // callback packet
void packet_callback_read_pedal(); // callback packet

// ===================================================================================
// Addressing Management and Network State Machine / GESTIONE INDIRIZZAMENTO E MACCHINA A STATI DI RETE
// ===================================================================================

///////////////////////////////////////////////////////////////////
// #define SIZE_BASE_AUX 13
uint8_t aux_buffer[13 + sizeof(usb_data_wireless)];
// 1 byte indicating connection establishment progress (current status)
// 6 bytes: MAC address of the transmitting device
// 6 bytes: MAC address of the device to which the packet is addressed
// On the final transmission, the gun also sends data from the USB_DATA_WIRELESS structure (containing the gun's VID, PID, etc.) so the dongle can initialize the USB connection using that data
// /
// 1 BYTE INDICATA L'AVANZAMENTO DELLO STABILIMENTO DELLA CONNESSIONE,A CHE PUNTO SIAMO
// 6 BYTE IL MAC ADDRESS DEL DISPOSITIVO CHE TRASMETTE
// 6 BYTE IL MAC ADDRESS DEL DISPOSITIVO A CUI E' INDIRIZZATO IL PACCHETTO
// ALL'ULTIMO INVIO LA GUN INVIA ANCHE I DATI DELLA STRUTTURA USB_DATA_WIRELESS CHE CONTIENE VID, PID, ECC. DELLA GUN IN MODO CHE IL DONGLE INZIALIZZI LA CONSSESIONE USB CON QUEI DATI

// Connection status
// /
// stato della connessione 

// For the GUN
// 0 = Not established
// 1 = Broadcast request sent
// 2 = Connection response received (request to connect)
// 3 = Connection confirmation sent
// /
// in caso di GUN
// 0 = non stabilita
// 1 = inviata richiesta blroad cast
// 2 = qualcuno ha risposto alla connessione ed ha chiesto di essere conesso
// 3 = inviato conferma connessione;

// For the DONGLE
// 0 = Not established
// 1 = Broadcast connection request received
// 2 = Accepted; connection request sent
// 3 = Connection acceptance received
// /
// in caso di DONGLE
// 0 = non stabilita
// 1 = arrivata richiesta broadcast di connessione
// 2 = accettata ed inviata richiesta di connessione
// 3 = arrivara accettazione di connessione

const uint8_t BROADCAST_ADDR[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

#if defined(DONGLE)
  uint8_t peerAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast
  const functionPtr callbackArr[] = { packet_callback_read_dongle };
  uint8_t lastDongleAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastPedalAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastDongleChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  uint8_t lastPedalChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  bool lastDongleSave = false; // If true, it means we have the address of the last dongle; otherwise, it is false. / se true significa che abbiamo un indirizzo dell'ultimo dongle altrimenti false
  bool lastPedalSave = false; 
#elif defined(PEDAL)
  uint8_t peerAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast
  const functionPtr callbackArr[] = { packet_callback_read_pedal };
  uint8_t lastDongleAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastPedalAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastDongleChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  uint8_t lastPedalChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  bool lastDongleSave = false; // If true, it means we have the address of the last dongle; otherwise, it is false. / se true significa che abbiamo un indirizzo dell'ultimo dongle altrimenti false
  bool lastPedalSave = false; 
#elif defined(GUN)
  uint8_t peerAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast
  const functionPtr callbackArr[] = { packet_callback_read_gun };
  uint8_t lastDongleAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastPedalAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastDongleChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  uint8_t lastPedalChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  bool lastDongleSave = false; // if true, it means the last dongle configuration was saved / se true significa
  bool lastPedalSave = false; // if true, it means the last pedal configuration was saved / se true significa
  // ==========================================================================================================
#endif

// ========= per gestione PEDAL ===========
uint8_t peerAddress_pedal[6] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00}; // broadcast
#define MAX_TIMEOUT_LAST_PACKET (uint64_t)100000   // = 100  ms  .. the value must be specified in microseconds. / il valore va specificato in microsecondi
void setupTimerPedal();
esp_timer_handle_t timer_handle_pedal;
// ===================================================

// ===================================================================================
// HARDWARE SETTINGS: RADIO FREQUENCY AND PHY / FREQUENZA RADIO E PHY
// ===================================================================================
///////////////////////////////////////////////////////////////////
// Overall definition of the rate configuration / Definizione globale della configurazione del rate
esp_now_rate_config_t rate_config = {
    .phymode = WIFI_PHY_MODE_11G, // Uses the G standard (best compromise between penetration and speed) / Forza lo standard G (Miglior compromesso penetrazione/velocità)
    .rate = WIFI_PHY_RATE_12M,    // Forces 12 Mbps (Ensures link stability at the expense of unnecessary bandwidth) / Forza i 12 Mbps (Garantisce stabilità del link a discapito della banda larga non necessaria)
    .ersu = false,                // Not necessary for 11g / Non necessario per 11g
    .dcm = false                  // Not necessary for 11g / Non necessario per 11g
};
////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////

volatile uint8_t channel_display = espnow_wifi_channel;
volatile uint8_t seconds_display = 30;
volatile bool broadcast_receiver = false;  

// ===================================================================================
// FREERTOS ASYNCHRONOUS TASKS (USB AND RADIO) / TASKS ASINCRONI FREERTOS (USB E RADIO)
// ===================================================================================

//////////////////////////////////////////////////////////////////////////////
TaskHandle_t xUSBTaskHandle = NULL;
#ifdef DONGLE

// The USB task manages the transmission of HID data to the PC, ensuring that the endpoint
// never becomes saturated. It employs a round-robin algorithm to rotate priority
// among the mouse, keyboard, and gamepad, preventing "chatty" peripherals (such as the mouse)
// from overshadowing the other controls.
// /
// Il task USB gestisce l'invio dei dati HID al PC garantendo che l'Endpoint non 
// venga mai saturato. Utilizza un algoritmo Round-Robin per dare priorità a rotazione 
// tra Mouse, Tastiera e Gamepad, evitando che periferiche "loquaci" (come il mouse) 
// oscurino gli altri controlli.

void usbTask(void *pvParameters) {
  // Keep track of whose turn it is. 
  // 0 = Mouse, 1 = Keyboard, 2 = Gamepad
  // /
  // Teniamo traccia di chi ha il turno. 
  // 0 = Mouse, 1 = Tastiera, 2 = Gamepad
  static int currentRotation = 0; 

