alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  for (;;) {
    // PAUSE THE TASK
    // It will wake up immediately if:
    // - The radio receives new data (your xTaskNotifyGive)
    // - USB transmission is complete (the tud_hid_report_complete_cb callback)
    // /
    // METTI IN PAUSA IL TASK
    // Si sveglierà istantaneamente se:
    // - La radio riceve un dato nuovo (il tuo xTaskNotifyGive)
    // - La USB ha finito di trasmettere (la callback tud_hid_report_complete_cb)
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

    // HARDWARE CHECK
    // Proceed only if the HID endpoint is physically free
    // /
    // CONTROLLO HARDWARE
    // Procediamo solo se l'Endpoint HID è fisicamente libero
    if (usbHid.ready()) {

      // ROUND-ROBIN ROTATION
      // Loop up to 3 times to find the first device with pending data
      // /
      // ROTAZIONE ROUND-ROBIN
      // Facciamo un ciclo di massimo 3 tentativi per trovare il primo dispositivo con dati pendenti
      for (int i = 0; i < 3; i++) {
        int target = (currentRotation + i) % 3;

        // --- TURN 0: MOUSE / TURNO 0: MOUSE ---
        if (target == 0 && absmouse5Report_pending) {
          if (usbHid.sendReport(HID_RID_e::HID_RID_MOUSE, &absmouse5Report_last_wifi, sizeof(absmouse5Report_last_wifi))) {
            absmouse5Report_pending = false; // Data processed / Dato smaltito
            currentRotation = 1;            // Next turn goes to the keyboard / Prossimo giro tocca alla Tastiera
            break; // IMPORTANT: Exit the for loop. The USB buffer is now full. / IMPORTANTE: Usciamo dal for. Il buffer USB ora è pieno.
          }
        }
        
        // --- TURN 1: KEYBOARD / TURNO 1: TASTIERA ---
        else if (target == 1 && keyReport_pending) {
          if (usbHid.sendReport(HID_RID_e::HID_RID_KEYBOARD, &keyReport_last_wifi, sizeof(keyReport_last_wifi))) {
            keyReport_pending = false; 
            currentRotation = 2;            // Next up: the Gamepad / Prossimo giro tocca al Gamepad
            break; 
          }
        }
        
        // --- TURN 2: GAMEPAD / TURNO 2: GAMEPAD ---
        else if (target == 2 && gamepad16Report_pending) {
          if (usbHid.sendReport(HID_RID_e::HID_RID_GAMEPAD, &gamepad16Report_last_wifi, sizeof(gamepad16Report_last_wifi))) {
            gamepad16Report_pending = false;
            currentRotation = 0;            // Next round, we start again from the Mouse. / Prossimo giro si riparte dal Mouse
            break; 
          }
        }
        
      } // End of the for loop / Fine del ciclo for
    }
    // If we reach this point (whether the USB was busy or we sent a report),
    // the task completes the iteration and goes back to sleep at the start of the for(;;) loop.
    // /
    // Se arriviamo qui (che la USB fosse occupata o che abbiamo inviato un report),
    // il task finisce il giro e torna a dormire all'inizio del for(;;)
  }
}
#endif // DONGLE
/////////////////////////////////////////////////////////////////////////////

TaskHandle_t xRadioTaskHandle = NULL;
volatile bool radioFree = true;

// The Radio task acts as the traffic controller. It remains "asleep" until
// it receives a notification (ESP-NOW ISR or Serial Timer).
// It handles both the parsing of incoming packets (bypassing the FSM)
// and the transmission of queued packets over the air.
// /
// Il task della Radio è il controllore del traffico. Rimane "addormentato" fino
// a quando non riceve una notifica (ISR ESP-NOW o Timer Seriale).
// Gestisce sia il Parsing dei pacchetti in arrivo (scavalcando la FSM), 
// sia l'emissione dei pacchetti in coda verso l'etere.

void radioTask(void *pvParameters) {
  while (1) {
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    
    bool progress;
    
    do {
      progress = false;

      // RECEPTION MANAGEMENT / GESTIONE RICEZIONE
      if (SerialWireless._reader != SerialWireless._writer) {
        SerialWireless.checkForRxPacket();
        progress = true;
      }

      // SERIAL MANAGEMENT -> RECOVERY MODE! / GESTIONE SERIALE -> RECOVERY MODE!
      // intervene ONLY if the timer has previously failed. / Interveniamo SOLO se il timer ha fallito in precedenza
      if (SerialWireless._serial_needs_recovery && (SerialWireless.availableBufferSerialWrite() > 0)) {
        if (SerialWireless.flush_sem()) {
          // Recovery successful! Lower the flag. 
          // SerialWireless._serial_needs_recovery = false; // flush_sem() already does this itself before returning true.
          // /
          // Salvataggio riuscito! Abbassiamo la bandierina.
          // SerialWireless._serial_needs_recovery = false; // flush_sem() lo fa già da sola prima di restituire true.
          progress = true; 
        }
      }

      // GESTIONE TRASMISSIONE RADIO
      if (radioFree && (SerialWireless.readIndex != SerialWireless.writeIndex)) {
        SerialWireless.SendData_sem();
        progress = true;
      }

    } while (progress); 
  } 
}
// =====================================

// ===================================================================================
// ASYNCHRONOUS GRAPHIC ANIMATIONS (TFT/OLED DISPLAY) / ANIMAZIONI GRAFICHE ASINCRONE (DISPLAY TFT/OLED)
// ===================================================================================
// These functions are executed on separate cores during "blocking" network phases
// to ensure the screen remains smooth and responsive, providing clear visual
// feedback to the user regarding the pairing process (UX pattern).
// /
// Queste funzioni sono lanciate su Core separati durante le fasi "bloccanti" di rete 
// per garantire che lo schermo sia fluido e reattivo, fornendo un chiaro feedback
// visuale sull'accoppiamento all'utente (UX Pattern).

/////////////////////////////////////////////////////////////////////////////
// GRAPHICAL CHANNEL SEARCH FOR GUN / VERSIONE GRAFICA RICERCA CANALE PER GUN //////////////////////////////////
/////////////////////////////////////////////////////////////////////////////

#if defined(GUN) && defined(USES_DISPLAY)
void animTaskLink_pedal(void *pvParameters) {
  const char* rotazione = "-\\|/-\\|/";
  int8_t rotazioneIndex = 0;
  const uint8_t baseX = 1;
  const uint8_t baseY = 2;
  const uint8_t charWidth = 6;
  uint8_t seconds_tread = seconds_display;
  
  // Initial display setup / Setup iniziale display
  display_OLED->setCursor(baseX, baseY);
  display_OLED->setTextSize(1);
  display_OLED->setTextColor(WHITE, BLACK);
  display_OLED->fillRect(0, 0, 128, 16, BLACK);
  display_OLED->drawFastHLine(0, 15, 128, WHITE);
  char buffer[30];
  sprintf(buffer, "Search Pedal [%2ds]", seconds_tread);                  
  display_OLED->print(buffer);
  display_OLED->display();

  // Task loop / Loop del task
  for (;;) {
    if (seconds_display != seconds_tread)
    {
      display_OLED->setCursor((14*6)+1, 2);
      seconds_tread = seconds_display;
      sprintf(buffer, "%2d", seconds_tread);
      display_OLED->print(buffer);
    }
    display_OLED->setCursor(baseX + (19 * charWidth), baseY);
    display_OLED->write(rotazione[rotazioneIndex]);
    rotazioneIndex = (rotazioneIndex + 1) % 8;
    display_OLED->display();
    vTaskDelay(pdMS_TO_TICKS(150)); // a short delay to avoid saturating the CPU / piccolo delay per non saturare la CPU
  } 
}

