alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
void animTaskLink(void *pvParameters) {
  const char* rotazione = "-\\|/-\\|/";
  int8_t rotazioneIndex = 0;
  const uint8_t baseX = 1;
  const uint8_t baseY = 2;
  const uint8_t charWidth = 6;
  uint8_t channel_tread = espnow_wifi_channel;
  
  // Initial display setup / Setup iniziale display
  display_OLED->setCursor(baseX, baseY);
  display_OLED->setTextSize(1);
  display_OLED->setTextColor(WHITE, BLACK);
  display_OLED->fillRect(0, 0, 128, 16, BLACK);
  display_OLED->drawFastHLine(0, 15, 128, WHITE);
  char buffer[30];
  sprintf(buffer, "Ch:%2d Waiting link", channel_tread);
  display_OLED->print(buffer);
  display_OLED->display();

  // Task loop / Loop del task
  for (;;) {
    if (channel_display != channel_tread)
    {
      display_OLED->setCursor(19, 2);
      channel_tread = channel_display;
      sprintf(buffer, "%2d", channel_tread);
      display_OLED->print(buffer);
    }
    display_OLED->setCursor(baseX + (19 * charWidth), baseY);
    display_OLED->write(rotazione[rotazioneIndex]);
    rotazioneIndex = (rotazioneIndex + 1) % 8;
    display_OLED->display();
    vTaskDelay(pdMS_TO_TICKS(150)); // a short delay to avoid saturating the CPU / piccolo delay per non saturare la CPU
  } 
}
#endif // GUN



/////////////////////////////////////////////////////////////////////////////
// END OF GRAPHIC VERSION CHANNEL SEARCH FOR GUN / FINE VERSIONE GRAFICA RICERCA CANALE PER GUN /////////////////////////////
/////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////
// Graphical Channel Search Version for Dongle / VERSIONE GRAFICA RICERCA CANALE PER DONGLE ///////////////////////////////
/////////////////////////////////////////////////////////////////////////////

#if defined(DONGLE) && defined(USES_DISPLAY)
void animTaskLink(void *pvParameters) {
  const char* rotazione = "-\\|/-\\|/";
  int8_t rotazioneIndex = 0;
  const uint8_t baseX = 75;
  const uint8_t baseY = 58;
  const uint8_t charWidth = 6;
  
  // Initial display setup / Setup iniziale display
  tft.setTextSize(1);
  tft.setTextColor(WHITE, BLACK);
  tft.fillRect(70,20,100,60,BLACK);
  tft.setCursor(baseX, baseY - 30);
  tft.print("Selected");
  tft.setCursor(baseX, baseY - 19);
  tft.print("channel:");
  tft.setCursor(baseX + (9 * charWidth)+3, baseY - 26);
  tft.setTextSize(2);
  tft.setTextColor(RED, BLACK);
  char buffer[10];
  sprintf(buffer, "%2d", espnow_wifi_channel);
  tft.print(buffer);
  tft.setTextSize(1);
  tft.setTextColor(WHITE, BLACK);
  tft.setCursor(baseX, baseY);
  tft.print("Connecting");
  #ifdef USE_LOVYAN_GFX
  tft.display();
  #endif // USE_LOVYAN_GFX
  tft.setTextSize(2);
  tft.setTextColor(BLUE, BLACK);

  // Task loop / Loop del task
  for (;;) {    
    tft.setCursor(baseX + (11 * charWidth) + 3, baseY);
    tft.write(rotazione[rotazioneIndex]);
    rotazioneIndex = (rotazioneIndex + 1) % 8;
    #ifdef USE_LOVYAN_GFX
    tft.display();
    #endif // USE_LOVYAN_GFX
    vTaskDelay(pdMS_TO_TICKS(150)); // piccolo delay per non saturare la CPU
  } 
}

void animTask(void *pvParameters) {
  int8_t currentIndex = 0;
  const uint8_t baseX = 75;
  const uint8_t baseY = 45;
  const uint8_t charWidth = 6;

  // Initial display setup / Setup iniziale display
  tft.setCursor(baseX, baseY);
  tft.setTextSize(1);
  tft.setTextColor(WHITE, BLACK);
  tft.setCursor(baseX + 12, baseY - 20);
  tft.print("Searching");
  tft.setCursor(baseX+3, baseY - 10);
  tft.print("best channel");
  tft.setCursor(baseX, baseY);
  tft.print("Scanning WiFi");
  #ifdef USE_LOVYAN_GFX
  tft.display();
  #endif // USE_LOVYAN_GFX
  tft.setTextColor(RED, BLACK);

  // Task loop / Loop del task
  for (;;) {  
    tft.setCursor(baseX + (3 * charWidth), baseY + 18);
    switch (currentIndex)
    {
    case 0:
      tft.print("   o   ");
      break;
    case 1:
      tft.print("  (o)  ");
      break;
    case 2:
      tft.print(" ((o)) ");
      break;
    case 3:
      tft.print("(((o)))");
      break;
    default:
    break;
    }
    currentIndex = (currentIndex + 1) % 4;
    #ifdef USE_LOVYAN_GFX
    tft.display();
    #endif // USE_LOVYAN_GFX
    vTaskDelay(pdMS_TO_TICKS(150)); // piccolo delay per non saturare la CPU
  }
}
#endif //DONGLE


/////////////////////////////////////////////////////////////////////////////
// End of graphical channel search version for dongle / FINE VERSIONE GRAFICA RICERCA CANALE PER DONGLE //////////////////////////
/////////////////////////////////////////////////////////////////////////////

// ===================================================================================
// Heuristic Best Channel Search (Auto-Channel Configuration) / RICERCA EURISTICA CANALE MIGLIORE (AUTO-CHANNEL CONFIGURATION)
// ===================================================================================
// This function, executed by the dongle, activates the radio chip's "promiscuous" mode
// to sniff the airwaves. It assigns a score to each channel based not only on the
// number of networks but, more importantly, on the actual noise floor and the
// packet traffic present at that moment. It selects the channel offering the
// best Signal-to-Noise Ratio (SNR) for ESP-NOW.
// /
// Questa funzione eseguita dal Dongle attiva la modalità "Promiscuous" del chip radio
// per annusare l'etere (sniffing). Assegna uno score a ciascun canale basato non
// solo sul numero di reti, ma soprattutto sul rumore reale (Noise Floor) e sul
// traffico effettivo dei pacchetti che transitano in quell'istante. Sceglie il 
// canale che offre il SNR (Signal-to-Noise Ratio) migliore per l'ESP-NOW.

// ================= BEST CHANNEL SEARCH FUNCTIONS - USED ONLY BY THE DONGLE / FUNZIONI PER RICERCA MIGLIORE CANALE - USATO SOLO DAL DONGLE =========================
#ifdef DONGLE

// ================= GLOBAL VARIABLES FOR CALLBACKS / VARIABILI GLOBALI PER CALLBACK =================
static volatile uint32_t g_packetCounter = 0;
static volatile bool g_sniffing = false;

// ================= CALLBACK PROMISCUOUS MODE =================
void IRAM_ATTR promiscuousCallback(void *buf, wifi_promiscuous_pkt_type_t type) {
  if (!g_sniffing) return;
  g_packetCounter = g_packetCounter + 1;
}

// ================= MAIN FUNCTION / FUNZIONE PRINCIPALE =================
uint8_t findBestChannel() {
  
