alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  #if defined(DONGLE) && defined(USES_DISPLAY)
  TaskHandle_t animTaskHandle = NULL;  
  if(display_init) {
  // Start animation / Avvio animazione
    if (animTaskHandle == NULL) {
      xTaskCreatePinnedToCore(
        animTask,          // task function / funzione del task
        "AnimTask",        // name / nome
        4096,              // stack size
        NULL,              // parameters / parametri
        1,                 // priority / priorità
        &animTaskHandle,   // handle
        APP_CPU_NUM        // core (you can use 0 or 1) / (puoi usare 0 o 1)
      );
    }
  }
  #endif // USES_DISPLAY


  // ================= STRUCTURE FOR CHANNEL STATISTICS & CHANNEL SEARCH / STRUTTURA PER STATISTICHE CANALE PER RICERCA BEST CHANNEL=================
  typedef struct {
    uint16_t networks;   // Number of APs detected / Numero di AP rilevati
    float avgRSSI;       // Average AP RSSI / RSSI medio degli AP
    int8_t maxRSSI;      // Maximum RSSI (strongest interference) / RSSI massimo (interferenza più forte)
    uint32_t packets;    // Packets captured in 600ms / Pacchetti catturati in 600ms
    float noise;         // Noise floor estimate / Stima noise floor
    float score;         // Base channel score / Score base del canale
  } ChannelStats;
  
  ChannelStats channelStats[14];
  memset(channelStats, 0, sizeof(channelStats));
  g_packetCounter = 0;
  g_sniffing = false;
  for (int i = 0; i < 14; i++) channelStats[i].maxRSSI = -128;

  // ================= PHASE 1: WiFi Network Scan / FASE 1: SCAN RETI WiFi =================
  // Time: ~2 seconds (150ms × 13 channels)
  // /
  // Tempo: ~2 secondi (150ms × 13 canali)
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  vTaskDelay(pdMS_TO_TICKS(100));

  // Optimized scan: 150ms per channel captures all beacons
  // (typical beacon interval: 100ms)
  // /
  // Scan ottimizzato: 150ms per canale cattura tutti i beacon
  // (beacon interval tipico: 100ms)
  int n = WiFi.scanNetworks(false, true, false, 150UL, 0);
  if (n < 0) n = 0;

  if (n > 0) {
    for (int i = 0; i < n; i++) {
      int ch = WiFi.channel(i);
      int rssi = WiFi.RSSI(i);
      if (ch >= 1 && ch <= 13) {
        if (channelStats[ch].networks < 65535) channelStats[ch].networks++;
        channelStats[ch].avgRSSI += rssi;
        if (rssi > channelStats[ch].maxRSSI) {
          channelStats[ch].maxRSSI = (int8_t)rssi;
        }
      }
    }
    
    // Calculate average RSSI
    // /
    // Calcola RSSI medio
    for (int ch = 1; ch <= 13; ch++) {
      if (channelStats[ch].networks > 0) {
        channelStats[ch].avgRSSI /= channelStats[ch].networks;
      } else {
        channelStats[ch].maxRSSI = -100; // Empty channel / Canale vuoto
      }
    }
  }
  
  WiFi.scanDelete();
  vTaskDelay(pdMS_TO_TICKS(50));

  // ================= PHASE 2: TRAFFIC SNIFFING AND NOISE / FASE 2: SNIFF TRAFFICO E NOISE =================
  // Time: ~12 seconds (920ms × 13 channels)
  // /
  // Tempo: ~12 secondi (920ms × 13 canali)
  
  vTaskDelay(pdMS_TO_TICKS(50));
  esp_wifi_set_promiscuous(true);
  esp_wifi_set_promiscuous_rx_cb(&promiscuousCallback);

  for (int ch = 1; ch <= 13; ch++) {

    esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE);
    vTaskDelay(pdMS_TO_TICKS(70)); // Radio stabilization / Stabilizzazione radio
    
    // --- Traffic measurement: 600ms full pattern capture ---
    // Includes: beacon (100ms), data burst, retry packets
    // /
    // --- Misurazione traffico: 600ms cattura pattern completi ---
    // Include: beacon (100ms), data burst, retry packets
    g_packetCounter = 0;
    g_sniffing = true;
    uint32_t startCount = g_packetCounter;
    vTaskDelay(pdMS_TO_TICKS(600));
    uint32_t endCount = g_packetCounter;
    channelStats[ch].packets = endCount - startCount;
    
    // --- Noise Floor Measurement: 15 samples for a stable average ---
    // /
    // --- Misurazione Noise Floor: 15 campioni per media stabile ---
    int32_t noiseSum = 0;
    const int samples = 15;
    for (int i = 0; i < samples; i++) {
      uint32_t start = g_packetCounter;
      vTaskDelay(pdMS_TO_TICKS(17)); // // Sampling 17ms (total 255ms) / Campionamento 17ms (totale 255ms)
      uint32_t activity = g_packetCounter - start;
      
      // Improved noise formula: logarithmic scale / Formula noise migliorata: scala logaritmica
      if (activity == 0) {
        noiseSum += -100; // Complete silence / Silenzio completo
      } else if (activity <= 3) {
        noiseSum += -95 + (activity * 3);
      } else if (activity <= 10) {
        noiseSum += -86 + (activity - 3) * 2;
      } else if (activity <= 30) {
        noiseSum += -72 + (activity - 10);
      } else {
        noiseSum += -52 + (activity - 30) / 2;
      }
    }
    
    channelStats[ch].noise = noiseSum / (float)samples;
    channelStats[ch].noise = constrain(channelStats[ch].noise, -100, -50);
  }

  g_sniffing = false;
  esp_wifi_set_promiscuous(false);
  esp_wifi_set_promiscuous_rx_cb(NULL);

  // ================= PHASE 3: OPTIMIZED SCORE CALCULATION / FASE 3: CALCOLO SCORE OTTIMIZZATO =================
  // Weights based on empirical analysis and Espressif documentation
  //
  // PRIORITIES FOR ESP-NOW:
  // 1. Strong RSSI = direct interference lowering SNR (KILLER #1)
  // 2. Actual traffic = packet collisions (KILLER #2)
  // 3. Number of networks = potential congestion (moderate)
  // 4. Noise floor = low impact (ESP-NOW uses robust MCS0/802.11b)
  // /
  // Pesi basati su analisi empirica e documentazione Espressif
  // 
  // priority / priorità PER ESP-NOW:
  // 1. RSSI forte = interferenza diretta che abbassa SNR (KILLER #1)
  // 2. Traffico reale = collisioni pacchetti (KILLER #2)
  // 3. Numero reti = congestione potenziale (moderato)
  // 4. Noise floor = basso impatto (ESP-NOW usa MCS0/802.11b robusto)
  
  const float wRSSI  = 0.40f;  // Direct interference = highest priority / Interferenza diretta = priorità massima
  const float wPkt   = 0.35f;  // Actual collisions = highly critical / Collisioni reali = molto critico
  const float wNet   = 0.20f;  // Congestion = moderate (log scale) / Congestione = moderato (scala log)
  const float wNoise = 0.05f;  // Noise = minimal (robust modulation) / Rumore = minimo (modulazione robusta)

  for (int ch = 1; ch <= 13; ch++) {
    
    // --- RSSI Score: most dangerous direct interference ---
    // AP with strong signal (-40dBm) nearby = guaranteed disaster
    // -100dBm (far away) = 0 points | -40dBm (nearby) = 40 points
    // /
    // --- Score RSSI: interferenza diretta più pericolosa ---
    // AP con segnale forte (-40dBm) vicino = disastro garantito
    // -100dBm (lontano) = 0 punti | -40dBm (vicino) = 40 punti
    float sRSSI = 0;
    if (channelStats[ch].maxRSSI > -100) {
      int rssiMapped = constrain(channelStats[ch].maxRSSI, -100, -30);
      sRSSI = map(rssiMapped, -100, -30, 0, 100) * wRSSI;
    }
    
