alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
    // --- Packet Score: measured real traffic ---
    // Normalized to 600ms: 0 pkts = 0 | 100 pkts = 35 points
    // /
    // --- Score Pacchetti: traffico reale misurato ---
    // Normalizzato su 600ms: 0 pkt = 0 | 100 pkt = 35 punti
    float sPkt = (channelStats[ch].packets / 10.0) * wPkt;
    if (sPkt > 100 * wPkt) sPkt = 100 * wPkt; // clamp max
    
    // --- Goals Score: logarithmic scale to avoid dominance ---
    // 0 goals = 0 | 1 goal = 4.2 | 5 goals = 9.2 | 10 goals = 13.8
    // /
    // --- Score Reti: scala logaritmica per evitare dominanza ---
    // 0 reti = 0 | 1 rete = 4.2 | 5 reti = 9.2 | 10 reti = 13.8
    float sNet = (channelStats[ch].networks > 0) 
                 ? (log(channelStats[ch].networks + 1) * 20.0) * wNet 
                 : 0;

    // --- RSSI Noise: minimum weight (ESP-NOW resistant) ---
    // -100dBm (silence) = 0 | -50dBm (noisy) = 5 points
    // /
    // --- Score Noise: peso minimo (ESP-NOW resistente) ---
    // -100dBm (silenzio) = 0 | -50dBm (rumoroso) = 5 punti
    int noiseMapped = constrain((int)channelStats[ch].noise, -100, -50);
    float sNoise = map(noiseMapped, -100, -50, 0, 100) * wNoise;
    
    channelStats[ch].score = sRSSI + sPkt + sNet + sNoise;
  }

  // ================= ADJACENT CHANNEL OVERLAP PENALTY / PENALITÀ OVERLAP CANALI ADIACENTI =================
  // WiFi 20MHz: each channel overlaps with ±4 channels
  // Reference: 802.11b uses 22MHz, 802.11g/n uses 20MHz + guardband
  // Non-overlapping channels: 1, 6, 11 (separated by 5 channels)
  //
  // Progressive penalties to simulate actual overlap:
  // ±1: 50% (maximum overlap, approx. 75% shared spectrum)
  // ±2: 35% (significant overlap, approx. 50% spectrum)
  // ±3: 20% (moderate overlap, approx. 25% spectrum)
  // ±4: 10% (minimal overlap, spectrum edges)
  // /
  // WiFi 20MHz: ogni canale si sovrappone con ±4 canali
  // Riferimento: 802.11b usa 22MHz, 802.11g/n usa 20MHz + guardband
  // Canali non-overlapping: 1, 6, 11 (separati di 5 canali)
  //
  // Penalità progressive per simulare overlap reale:
  // ±1: 50% (overlap massimo, circa 75% spettro condiviso)
  // ±2: 35% (overlap significativo, circa 50% spettro)
  // ±3: 20% (overlap moderato, circa 25% spettro)
  // ±4: 10% (overlap minimo, bordi spettro)
  
  float finalScores[14];
  for (int ch = 1; ch <= 13; ch++) {
    finalScores[ch] = channelStats[ch].score;
    
    // Full overlap penalty, 20MHz model / Penalità overlap completo modello 20MHz
    if (ch > 1) finalScores[ch] += channelStats[ch-1].score * 0.50f;
    if (ch > 2) finalScores[ch] += channelStats[ch-2].score * 0.35f;
    if (ch > 3) finalScores[ch] += channelStats[ch-3].score * 0.20f;
    if (ch > 4) finalScores[ch] += channelStats[ch-4].score * 0.10f;
    
    if (ch < 13) finalScores[ch] += channelStats[ch+1].score * 0.50f;
    if (ch < 12) finalScores[ch] += channelStats[ch+2].score * 0.35f;
    if (ch < 11) finalScores[ch] += channelStats[ch+3].score * 0.20f;
    if (ch < 10) finalScores[ch] += channelStats[ch+4].score * 0.10f;
  
    // After calculating finalScores, award bonuses to the ideal channels / Dopo il calcolo finalScores, dare bonus ai canali ideali
    if (ch == 1 || ch == 6 || ch == 11) {
      finalScores[ch] *= 0.92f; // -8% bonus(preference)/(preferenza) 
    }  
  }

  // ================= PHASE 4: SELECTION OF THE BEST CHANNEL / FASE 4: SELEZIONE MIGLIOR CANALE =================
  uint8_t bestCh = 1;
  float minScore = 999999.0;
  
  for (uint8_t ch = 1; ch <= 13; ch++) {
    if (finalScores[ch] < minScore) {
      minScore = finalScores[ch];
      bestCh = ch;
    }
  }
  
  // ================= Final cleaning / PULIZIA FINALE =================
  vTaskDelay(pdMS_TO_TICKS(50));
  g_packetCounter = 0;
  g_sniffing = false;
  
  #if defined(DONGLE) && defined(USES_DISPLAY)
    if (animTaskHandle != NULL) {
      vTaskDelete(animTaskHandle);
      animTaskHandle = NULL;
    }
  #endif // USES_DISPLAY
  
  return bestCh;
}
#endif // DONGLE
// ================= End of best channel search functions – used only by the dongle. / FINE FUNZIONI PER RICERCA MIGLIORE CANALE - USATO SOLO DAL DONGLE =========================

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/*****************************
 *   SERIAL WIRELESS SECTION
 *****************************/
// ===================================================================================
// STREAM INTERFACE: ABSTRACTION OF THE RADIO AS A VIRTUAL SERIAL PORT / INTERFACCIA STREAM: ASTRAZIONE DELLA RADIO COME PORTA SERIALE VIRTUALE
// ===================================================================================
// These methods override the standard Arduino `Stream` interface.
// The architectural goal is to allow the rest of the code (e.g. parsing logic
// or external libraries) to read and write data from/to the ESP-NOW network
// exactly as if it were a normal serial cable connection.
// Latency is masked by the use of Ring Buffers and Lock-Free Indexes.
// /
// Questi metodi sovrascrivono l'interfaccia standard `Stream` di Arduino. 
// L'obiettivo architettonico è permettere al resto del codice (es. logica di parsing 
// o librerie esterne) di leggere e scrivere dati dalla/verso la rete ESP-NOW 
// esattamente come se fosse una normale connessione seriale via cavo.
// La latenza è mascherata dall'uso di buffer circolari (Ring Buffers) e indici Lock-Free.

SerialWireless_::operator bool() {
  return true;
}

int SerialWireless_::peek() {
  if (_writerSerialRead == _readerSerialRead) return -1;
  return bufferSerialRead[_readerSerialRead];
}

int SerialWireless_::peekBin() {
  if (writeIndex == readIndex) return -1;
  return buffer[readIndex];
}

// Extracts a single byte from the circular receive buffer.
// Using the bitwise operator (& MASK_READ_SERIAL) replaces the costly modulo operator (%),
// ensuring index wrap-around in a single clock cycle.
// /
// Estrae un singolo byte dal buffer circolare di ricezione. 
// L'uso dell'operatore bitwise (& MASK_READ_SERIAL) sostituisce il costoso operatore modulo (%),
// garantendo il wrap-around dell'indice in un singolo ciclo di clock.
int SerialWireless_::read() {
  uint16_t r = _readerSerialRead;
  if (r == _writerSerialRead) return -1;

  uint8_t ret = bufferSerialRead[r];
  _readerSerialRead = (r + 1) & MASK_READ_SERIAL;
  return (int)ret;
}

int SerialWireless_::readBin() {
  uint16_t r = _reader;
  uint16_t w = _writer;

