alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  if (r == w) return -1;
  uint8_t ret = _queue[r];

  const uint16_t MASK = FIFO_SIZE_READ - 1;
  _reader = (r + 1) & MASK;
  return (int)ret;
}

// ===================================================================================
// ASYNCHRONOUS PARSING ENGINE AND LOCK-FREE MEMORY MANAGEMENT / MOTORE DI PARSING ASINCRONO E GESTIONE MEMORIA LOCK-FREE
// ===================================================================================

// This function is called by the `radioTask`. It inspects the raw data queue
// (populated by the radio ISR) and immediately passes it to the COBS protocol
// state machine (`packet.parse`).
// /
// Questa funzione viene chiamata dal `radioTask`. Ispeziona la coda dati grezzi 
// (riempita dalla ISR della radio) e la passa istantaneamente alla macchina a stati 
// del protocollo COBS (`packet.parse`).
bool SerialWireless_::checkForRxPacket() {
    // 1. Local snapshot of the indices at this precise moment
    // This is the heart of the lock-free pattern: we read the current state without blocking
    // the hardware interrupt that might be writing simultaneously.
    // /
    // 1. Snapshot locale degli indici in questo preciso istante
    // Questo è il cuore del pattern Lock-Free: leggiamo lo stato corrente senza bloccare 
    // l'hardware interrupt che potrebbe star scrivendo contemporaneamente.
    uint16_t r = _reader;
    uint16_t w = _writer; // Let's look at where the ESP-NOW callback has ended up. / Guardiamo dove è arrivata la callback ESP-NOW
    const uint16_t MASK = FIFO_SIZE_READ - 1;

    // 2. Lock-free calculation of available data
    // This formula handles wrap-around automatically within a single clock cycle.
    // /
    // 2. Calcolo Lock-Free dei dati disponibili
    // Questa formula gestisce il wrap-around da sola in un ciclo di clock
    uint16_t available = (w - r) & MASK;
    
    // Quick exit if there is nothing to read / Uscita rapida se non c'è nulla da leggere
    if (available == 0) return false;

    // 3. Local cache for maximum performance / Cache locale per massime prestazioni
    uint8_t* queuePtr = _queue;

    // 4. Rapid "draining" cycle and parsing / Ciclo di "svuotamento" rapido e Parsing
    for (uint16_t i = 0; i < available; i++) {
        uint8_t dato = queuePtr[r];
        
        // The parser operates in real time. / Il parser lavora in tempo reale.
        packet.parse(dato, true); 

        // Advancement with bitwise wrap-around / Avanzamento con wrap-around bitwise
        r = (r + 1) & MASK;
    }

    // --- COMPILER BARRIER / BARRIERA DEL COMPILATORE ---
    // Essential on Xtensa/ARM architectures: Ensures the CPU physically finishes
    // transferring all bytes from cached RAM to main RAM
    // BEFORE telling the ISR (Interrupt Service Routine) that the space is free again.
    // /
    // Essenziale sulle architetture Xtensa/ARM: Assicura che la CPU finisca 
    // fisicamente di trasferire tutti i byte dalla RAM cacheata alla RAM principale
    // PRIMA di dire all'ISR (Interrupt Service Routine) che lo spazio è di nuovo libero. 
    asm volatile ("memw" : : : "memory");

    // 5. Final ATOMIC synchronization / Sincronizzazione finale ATOMICA
    // We update _reader in RAM exactly once. As soon as this line executes,
    // the RX callback mathematically determines that there is new free space for writing.
    // /
    // Aggiorniamo _reader in RAM una sola volta. Appena viene eseguita questa riga,
    // la callback RX capisce matematicamente che c'è nuovo spazio libero per scrivere.
    _reader = r;

    return true;
}

int SerialWireless_::available() {
  // Distance between writer and reader / Distanza tra chi scrive e chi legge
  return (_writerSerialRead - _readerSerialRead) & MASK_READ_SERIAL;
}

int SerialWireless_::availableBin() {
  return (writeIndex - readIndex) & (BUFFER_SIZE - 1);
}

// How many FREE bytes remain in the buffer (Standard Arduino API) / Quanti byte LIBERI rimangono nel buffer (Standard Arduino API)
int SerialWireless_::availableForWrite() {
  return (_readerSerialWrite - _writerSerialWrite - 1) & MASK_WRITE_SERIAL;
}

// helper function / funzione di comodo
// How many bytes are currently in the buffer waiting to be sent
// /
// Quanti byte sono attualmente nel buffer in attesa di essere inviati
int SerialWireless_::availableBufferSerialWrite() {
  return (_writerSerialWrite - _readerSerialWrite) & MASK_WRITE_SERIAL;
}

int SerialWireless_::availableForWriteBin() {
  return (readIndex - writeIndex - 1) & (BUFFER_SIZE - 1);
}

// ===================================================================================
// DATA TRANSMISSION: PRODUCER-CONSUMER PATTERN / TRASMISSIONE DATI: PRODUCER-CONSUMER PATTERN
// ===================================================================================

// In a hardware serial interface, `flush` blocks the thread until the last bit leaves the TX pin.
// Here, however, `flush` packages the data into the ring buffer and "wakes up" the radio task.
// If the network buffer is saturated, we use `taskYIELD` to voluntarily yield control
// to the operating system (FreeRTOS), allowing the radio task to transmit and free up space,
// thereby preventing Watchdog Timeouts and keeping the system responsive.
// /
// In una seriale hardware, `flush` blocca il thread finché l'ultimo bit non lascia il pin TX. 
// Qui invece il flush impacchetta i dati nel ring buffer e "sveglia" il task radio. 
// Se il buffer di rete è saturo, usiamo taskYIELD per cedere volontariamente il controllo 
// al sistema operativo (FreeRTOS) permettendo al task radio di trasmettere e liberare spazio, 
// prevenendo così i Watchdog Timeout e mantenendo il sistema responsivo.
void SerialWireless_::flush() {
  // The flush must wait as long as there is data in the serial write buffer. / Il flush deve attendere finché ci sono dati nel buffer di scrittura seriale
  while (availableBufferSerialWrite() > 0) {
    
    // We call flush_sem(). 
    // There is no need to acquire the mutex here because flush_sem()
    // internally uses the spinlock (portENTER_CRITICAL) to protect the pointers.
    // /
    // Chiamiamo flush_sem(). 
    // Non serve prendere il Mutex qui perché flush_sem() al suo interno 
    // usa già lo Spinlock (portENTER_CRITICAL) per proteggere i puntatori.
    if (!flush_sem()) {
      // If flush_sem() returns false, it means the RADIO buffer is full. 
      // We need to give radioTask time to transmit in order to free up space.
      // /
      // Se flush_sem() restituisce false, significa che il buffer RADIO è pieno.
      // Dobbiamo dare tempo al radioTask di trasmettere per liberare spazio.
      taskYIELD(); 
    }
    
    // A brief pause to avoid "hogging" the core if the buffer is very large
    // /
    // Un piccolo respiro per non "sequestrare" il Core se il buffer è molto grande
    taskYIELD(); 
  }
}

// Preparation phase: Retrieve pending serial data, apply COBS stuffing,
// encapsulate the result in a packet with an ID and CRC, and place it in the buffer,
// ready for transmission over the air.
// /
// Fase di preparazione: Preleva i dati seriali in attesa, applica lo stuffing COBS, 
// incapsula il tutto in un pacchetto con ID e CRC, e lo deposita nel buffer pronto 
// per essere spedito in etere.
bool SerialWireless_::flush_sem() {
  bool packed_data = false;
  
