alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  // 1. Serial Lock / Lucchetto Seriale
  portENTER_CRITICAL(&mux_serial_tx);

  uint16_t w = _writerSerialWrite;
  uint16_t r = _readerSerialWrite;
  uint16_t available_tx = (w - r) & MASK_WRITE_SERIAL;

  if (available_tx > 0) {
    // 2. Lock the radio before calculating the space! / LUCCHETTO RADIO PRIMA DI CONTARE LO SPAZIO!
    // Now no one can steal the space from us while we calculate the packet. / Ora nessuno può rubarci lo spazio mentre calcoliamo il pacchetto
    portENTER_CRITICAL(&mux_radio_tx);

    uint16_t space_in_radio = availableForWriteBin();
    const uint16_t overhead = PREAMBLE_SIZE + POSTAMBLE_SIZE;

    if (space_in_radio > overhead) {
      uint16_t max_payload = space_in_radio - overhead;
      
      // Dynamic fragmentation strategy:
      // If the data exceeds the physical limit of a single ESP-NOW packet or the payload
      // capacity (200 bytes for safety), we split the transmission into smaller chunks.
      // /
      // Strategia di frammentazione dinamica:
      // Se i dati superano il limite fisico di un singolo pacchetto ESP-NOW o la capacità 
      // del payload (200 byte per sicurezza), spezziamo l'invio in chunk più piccoli.
      uint16_t len_to_pack = std::min((uint16_t)available_tx, std::min((uint16_t)200, max_payload));

      uint16_t firstChunk = FIFO_SIZE_WRITE_SERIAL - r;
      if (firstChunk < len_to_pack) {
        memcpy(&packet.txBuff[PREAMBLE_SIZE], &bufferSerialWrite[r], firstChunk);
        memcpy(&packet.txBuff[PREAMBLE_SIZE + firstChunk], &bufferSerialWrite[0], len_to_pack - firstChunk);
      } else {
        memcpy(&packet.txBuff[PREAMBLE_SIZE], &bufferSerialWrite[r], len_to_pack);
      }

      packet.constructPacket(len_to_pack, PACKET_TX::SERIAL_TX);
      
      writeBin(packet.txBuff, len_to_pack + overhead);
      
      _readerSerialWrite = (r + len_to_pack) & MASK_WRITE_SERIAL;
      packed_data = true;
    }
    
    // Release the radio / Rilasciamo la radio
    portEXIT_CRITICAL(&mux_radio_tx);
  }

  // Release the serial port / Rilasciamo la seriale
  portEXIT_CRITICAL(&mux_serial_tx); 

  // System API / API di sistema
  // Signal the asynchronous Radio Task that there are new packets ready for transmission
  // /
  // Segnaliamo al Task Radio asincrono che ci sono nuovi pacchetti pronti al decollo.
  if (packed_data) {
    esp_timer_stop(timer_handle_serial);
    xTaskNotifyGive(xRadioTaskHandle);
    _serial_needs_recovery = false;
    return true;
  }

  return false; 
}

// Launch phase: This function physically "pushes" the bits into the ESP-NOW radio hardware.
// /
// Fase di lancio: Questa funzione "spinge" fisicamente i bit nell'hardware radio ESP-NOW.
void SerialWireless_::SendData_sem() {
  // Snapshot locale degli indici
  const uint16_t r = readIndex;
  const uint16_t w = writeIndex; // Let's look at where the producer has reached at this moment. / Guardiamo dove è arrivato il produttore in questo istante
  const uint16_t MASK = BUFFER_SIZE - 1;

  // Lock-free calculation of available data
  // This formula automatically handles wrap-around
  // /
  // Calcolo Lock-Free dei dati disponibili
  // Questa formula gestisce il wrap-around automaticamente
  const uint16_t available_data = (w - r) & MASK;

  // Early exit if there is nothing to send
  // /
  // Uscita rapida se non c'è nulla da spedire
  if (available_data == 0) return;

  uint16_t len_tx = available_data;

  // PACKET ALIGNMENT ("Cut" prevention)
  // ESP-NOW has a hard hardware limit of 250 bytes per payload. 
  // Truncating a frame mid-stream breaks the COBS protocol on the receiving end. 
  // Therefore, we scan the buffer backwards for a terminator byte (0xFF)
  // and align the cut to ensure that logically intact packets are sent.
  // /
  // ALLINEAMENTO PACCHETTI (Prevenzione "taglio")
  // ESP-NOW ha un limite hardware rigido di 250 byte per payload.
  // Se tronchiamo un frame a metà distruggiamo il protocollo COBS in ricezione.
  // Pertanto, analizziamo il buffer a ritroso cercando un byte terminatore (0xFF) 
  // e allineiamo il taglio garantendo l'invio di pacchetti logicamente integri.
  if (available_data > ESP_NOW_MAX_DATA_LEN) {
    uint16_t aligned_len = 0;
    
    // Backward scan from the physical limit. / Scansione a ritroso dal limite fisico.
    for (uint16_t i = ESP_NOW_MAX_DATA_LEN; i > 0; i--) {
      if (buffer[(r + i) & MASK] == START_BYTE) {
        aligned_len = i; 
        break;
      }
    }

    len_tx = (aligned_len > 0) ? aligned_len : ESP_NOW_MAX_DATA_LEN;
  }

  // BATCH COPY / COPIA BATCH
  const uint16_t firstChunk = BUFFER_SIZE - r;
  
  if (firstChunk < len_tx) {
    const uint16_t secondChunk = len_tx - firstChunk;
    memcpy(buffer_espnow, &buffer[r], firstChunk);
    memcpy(&buffer_espnow[firstChunk], &buffer[0], secondChunk);
  } else {
    memcpy(buffer_espnow, &buffer[r], len_tx);
  }

// SUBMISSION AND UPDATING / INVIO E AGGIORNAMENTO
  esp_err_t result = esp_now_send(peerAddress, buffer_espnow, len_tx);
  
  if (result == ESP_OK) {
    radioFree = false; 
    
    // ATOMIC Update / Aggiornamento ATOMICO
    readIndex = (r + len_tx) & MASK; 
  } else {
    // THE HEALTHY FREEZE:
    // Transmission failed (e.g., peer powered off/interference). 
    // We do not advance readIndex to avoid losing vital serial data. 
    // However, we pause the system for 1 ms to prevent the Watchdog from triggering
    // and to avoid a forced reboot of the Lightgun.
    // /
    // IL FREEZE SANO:
    // L'invio è fallito (es. peer spento/interferenza).
    // Non avanziamo readIndex per non perdere i dati seriali vitali.
    // Ma diamo 1 ms di pausa al sistema per non far intervenire il Watchdog
    // e prevenire un riavvio forzato della Lightgun.
    vTaskDelay(pdMS_TO_TICKS(1));
  }
}

size_t SerialWireless_::write(uint8_t c) {
  return write(&c, 1);
}

size_t SerialWireless_::writeBin(uint8_t c) {
  return writeBin(&c, 1);
}

size_t SerialWireless_::write(const uint8_t *data, size_t len) {
  size_t written = 0;
  bool start_timer = false; // Security flag / Flag di sicurezza

  while (written < len) {
    start_timer = false; // We reset at every cycle. / Resettiamo a ogni ciclo
    
    portENTER_CRITICAL(&mux_serial_tx); // --- LOCK START / INIZIO LOCK ---

    uint16_t w = _writerSerialWrite;
    uint16_t r = _readerSerialWrite;
    uint16_t free_space = (r - w - 1) & MASK_WRITE_SERIAL;

