alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
    if (free_space > 0) {
      size_t toWrite = std::min((size_t)free_space, len - written);
      uint16_t firstChunk = FIFO_SIZE_WRITE_SERIAL - w;
      
      if (firstChunk < toWrite) {
        memcpy(&bufferSerialWrite[w], &data[written], firstChunk);
        memcpy(&bufferSerialWrite[0], &data[written + firstChunk], toWrite - firstChunk);
      } else {
        memcpy(&bufferSerialWrite[w], &data[written], toWrite);
      }

      if (w == r) {
        start_timer = true; // Let's raise the flag instead of calling the API. / Alziamo la flag invece di chiamare l'API
      }

      asm volatile ("memw" : : : "memory");
      _writerSerialWrite = (w + toWrite) & MASK_WRITE_SERIAL;
      
      portEXIT_CRITICAL(&mux_serial_tx); // --- END LOCK / FINE LOCK ---

      // We are safe now: start the timer if necessary! 
      // We use a hardware timer to ensure that even small payloads (which do not
      // saturate the buffer) are regularly flushed without getting stuck.
      // /
      // Ora siamo al sicuro: avviamo il timer se necessario!
      // Usiamo un timer hardware per garantire che anche piccoli payload (che non 
      // saturano il buffer) vengano flushati regolarmente senza rimanere incastrati.
      if (start_timer) {
        esp_timer_start_once(timer_handle_serial, TIMER_HANDLE_SERIAL_DURATION_MICROS);
      }

      written += toWrite;
      xTaskNotifyGive(xRadioTaskHandle);
    } 
    else {
      portEXIT_CRITICAL(&mux_serial_tx);
      
      if (!flush_sem()) {
        taskYIELD(); 
      }
    }
  }
  return written;
}

size_t SerialWireless_::writeBin(const uint8_t *data, size_t len) {
  // Use the same lock as SendPacket for consistency and speed
  // A hardware mutex momentarily disables interrupts: use it
  // for the absolute minimum time necessary.
  // /
  // Usa lo stesso lucchetto di SendPacket per coerenza e velocità
  // Un mutex hardware disabilita gli interrupt momentaneamente: usiamolo
  // per il minimo tempo indispensabile.
  portENTER_CRITICAL(&mux_radio_tx);

  uint16_t w = writeIndex;
  uint16_t r = readIndex;
  const uint16_t MASK = BUFFER_SIZE - 1;

  // Space calculation (Minus-One Rule) / Calcolo dello spazio (Regola del Meno Uno)
  uint16_t free_space = (r - w - 1) & MASK;

  if (free_space < len) {
    _overflow_write = true;
    portEXIT_CRITICAL(&mux_radio_tx); 
    return 0; 
  }

  // BATCH COPY / COPIA BATCH (Wrap-around logic)
  uint16_t firstChunk = BUFFER_SIZE - w;

  if (firstChunk < len) {
    memcpy(&buffer[w], data, firstChunk);
    memcpy(&buffer[0], data + firstChunk, len - firstChunk);
  } else {
    memcpy(&buffer[w], data, len);
  }

  // MEMORY BARRIER - Essential for ESP32/Xtensa / BARRIERA DI MEMORIA - Fondamentale per ESP32/Xtensa
  asm volatile ("memw" : : : "memory");

  // Index Update - Atomic / Aggiornamento dell'indice - Atomico
  writeIndex = (w + len) & MASK; 

  portEXIT_CRITICAL(&mux_radio_tx);

  return len;
}

void SerialWireless_::SendPacket(const uint8_t *data, uint8_t len, uint8_t packetID) { 
  const uint16_t totalLen = len + PREAMBLE_SIZE + POSTAMBLE_SIZE;

  // Enter critical section (hardware spinlock)
  // Extremely fast; protects the packet.txBuff "workspace" from other cores or tasks
  // /
  // Entriamo in sezione critica (Spinlock hardware)
  // Velocissimo, protegge il "tavolo da lavoro" packet.txBuff da altri Core o Task
  portENTER_CRITICAL(&mux_radio_tx);

  // Lock-free snapshot of available space / Snapshot Lock-Free dello spazio disponibile
  uint16_t w = writeIndex;
  uint16_t r = readIndex;
  const uint16_t MASK = BUFFER_SIZE - 1;
  uint16_t free_space = (r - w - 1) & MASK; 

  // If there is space, we build and write right away. / Se c'è spazio, costruiamo e scriviamo subito
  if (free_space >= totalLen) {
    uint8_t* pDest = packet.txBuff;

    // We copy the data and build the packet in the temporary buffer. / Copiamo i dati e costruiamo il pacchetto nel buffer temporaneo
    memcpy(&pDest[PREAMBLE_SIZE], data, len);
    packet.constructPacket(len, packetID);
    
    // Insert into the main Ring Buffer
    // (Since we are already in a critical section, writeBin will be lightning-fast)
    // /
    // Inseriamo nel Ring Buffer principale
    // (Dato che siamo già in sezione critica, writeBin sarà un fulmine)
    writeBin(pDest, totalLen);
    
    // Exit the critical section before notifying
    // /
    // Usciamo dalla sezione critica prima di notificare
    portEXIT_CRITICAL(&mux_radio_tx);

    // Wake up the radioTask / Svegliamo il radioTask
    xTaskNotifyGive(xRadioTaskHandle);
  } 
  else {
    portEXIT_CRITICAL(&mux_radio_tx);
    _overflow_write = true;
  }
}

void SerialWireless_::write_on_rx_serialBuffer(const uint8_t *data, int len) {
  uint16_t w = _writerSerialRead;
  uint16_t r = _readerSerialRead;
  
  // Calculation of free space (Minus-One Rule) / Calcolo spazio libero (Regola del Meno Uno)
  uint16_t free_space = (r - w - 1) & MASK_READ_SERIAL;

  if (free_space >= len) {
    uint16_t firstChunk = FIFO_SIZE_READ_SERIAL - w;
    if (firstChunk < len) {
      memcpy(&bufferSerialRead[w], data, firstChunk);
      memcpy(&bufferSerialRead[0], data + firstChunk, len - firstChunk);
    } else {
      memcpy(&bufferSerialRead[w], data, len);
    }
    
    // Memory barrier before updating the pointer / Barriera di memoria prima di aggiornare il puntatore
    asm volatile ("memw" : : : "memory");
    _writerSerialRead = (w + len) & MASK_READ_SERIAL;
  } else {
    _overflow_bufferSerialRead = true;
  }
}

bool SerialWireless_::end() {

  vTaskDelete(xRadioTaskHandle);
  // vTaskDelete(xUSBTaskHandle); // This only goes into the dongle. / questo va solo nel dongle
  
  esp_err_t err = esp_now_deinit();
  if (err != ESP_OK) {
    //Serial.printf("esp_now_deinit failed! 0x%x", err);
    return false;
  }
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF); // Turn off Wi-Fi / Disattiva il WiFi
  esp_timer_delete(timer_handle_serial);
  return true;
}


void SerialWireless_::init_wireless() {
  configST myConfig; // configuration utility variable / variabile di utilità per configurazione
  
  myConfig.timeout      = DEFAULT_TIMEOUT; // 50ms
  myConfig.callbacks    = callbackArr;
  myConfig.callbacksLen = sizeof(callbackArr) / sizeof(functionPtr);
  packet.begin(myConfig);

