alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  setupTimerSerial(); // Create the timers for sending serial data. / crea i timer .. timer per invio dati seriali

  // ========= ADDITION FOR NEW RADIO TRANSMISSION/RECEPTION MANAGEMENT FOR ALL / AGGIUNTA PER NUOVA GESTIONE TRASMISSIONE RICEZIONE RADIO X TUTTI===============
  xTaskCreatePinnedToCore(
        radioTask,          // task function / funzione del task
        "radioTask",        // name / nome
        4096,              // stack size
        NULL,              // parameters / parametri
        15,                 // HIGH priority 1 to 24? / priorità ALTA DA 1 A 24 ?
        &xRadioTaskHandle,   // handle
        APP_CPU_NUM        // core (you can use 0 or 1) / (puoi usare 0 o 1)
      );
  // ========== END ADDITION FOR NEW RADIO TRANSMISSION/RECEPTION MANAGEMENT FOR ALL / FINE AGGIUNTA PER NUOVA GESTIONE =================

  #ifdef DONGLE
  // ========= Addition for new USB dongle management (applies only to the dongle) / AGGIUNTA PER NUOVA GESTIONE DONGLE USB (SERVE SOLO AL DONGLE) ===============
  xTaskCreatePinnedToCore(
        usbTask,          // task function / funzione del task
        "usbTask",        // name / nome
        4096,              // stack size
        NULL,              // parameters / parametri
        10,                 // HIGH priority 1 to 24? / priorità ALTA DA 1 A 24 ?
        &xUSBTaskHandle,   // handle
        APP_CPU_NUM        // core (you can use 0 or 1) / (puoi usare 0 o 1) APP_CPU_NUM = 1 (dove gira il loop) PRO_CPU_NUM = 0 (dove gira freertos, wifi, ecc.)
      );
  // ========== END Addition for new USB dongle management (applies only to the dongle) / FINE AGGIUNTA PER NUOVA GESTIONE =================
  #endif // DONGLE

}


void SerialWireless_::begin() {

  #ifdef GUN
    if (lastDongleSave) espnow_wifi_channel=lastDongleChannel;
      else espnow_wifi_channel=OPENFIRE_ESPNOW_WIFI_CHANNEL;
  #endif //GUN

  #ifdef DONGLE
    
      #ifdef OPENFIRE_AUTO_CHANNEL_ESPNOW_WIFI
        espnow_wifi_channel = findBestChannel(); //12;             
      #else
        espnow_wifi_channel=OPENFIRE_ESPNOW_WIFI_CHANNEL;
      #endif // OPENFIRE_AUTO_CHANNEL_ESPNOW_WIFI
     
  #endif // DONGLE

  #ifdef PEDAL
      espnow_wifi_channel=OPENFIRE_ESPNOW_WIFI_CHANNEL;
  #endif //GUN


  WiFi.mode(WIFI_STA); 
  WiFi.disconnect();
  

  esp_err_t err = esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11G); // | WIFI_PROTOCOL_11N);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_protocol failed! 0x%x", err);
  }
  
  err = esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW_HT20);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_bandwidth failed! 0x%x", err);
  }
  
  err = esp_wifi_get_mac(WIFI_IF_STA, mac_esp_inteface);
  if (err != ESP_OK) {
    //Serial.println("Failed to read MAC address");
  }
  
  esp_wifi_set_promiscuous(true);
  err = esp_wifi_set_channel(espnow_wifi_channel, WIFI_SECOND_CHAN_NONE);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_channel failed! 0x%x", err);
  }
  esp_wifi_set_promiscuous(false);

  err = esp_wifi_set_max_tx_power(espnow_wifi_power); // between 8 and 84 (corresponding to 2 dBm to 20 dBm); / tra 8 e 84 corrispondenti a 2dbm a 20 dbm);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_max_tx_power failed! 0x%x", err);
  }

  err = esp_wifi_set_ps(WIFI_PS_NONE);  // Disable power saving for maximum responsiveness. / DISABILITA IL POWER SAVE PER MASSIMA REATTIVITà
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_ps failed! 0x%x", err);
  }
  
  vTaskDelay(pdMS_TO_TICKS(500)); // delay(1000);
    
  err = esp_now_init();
  if (err != ESP_OK) {
    //Serial.printf("esp_now_init failed! 0x%x", err);
  }
    
  if (lastDongleSave) {
    memcpy(peerAddress, lastDongleAddress,6);
    stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION_DONGLE;
  } else {
    memcpy(peerAddress, BROADCAST_ADDR, 6);
    stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
  }
  
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  peerInfo.channel = espnow_wifi_channel;
  peerInfo.encrypt = false;
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {
    //Serial.println("Error adding peer");
    //Serial.println("Errore nell'aggiunta del peer");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);

  err = esp_now_register_recv_cb(_esp_now_rx_cb);
  if (err != ESP_OK) {
    //Serial.printf("esp_now_register_recv_cb failed! 0x%x", err);
  }

  err = esp_now_register_send_cb(_esp_now_tx_cb);
  if (err != ESP_OK) {
    //Serial.printf("esp_now_register_send_cb failed! 0x%x", err);
  }

  TinyUSBDevices.wireless_mode = WIRELESS_MODE::ENABLE_ESP_NOW_TO_DONGLE;
}

/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////

// ===================================================================================
// HANDSHAKE PROTOCOL: CONNECTION STATE MACHINE / MACCHINA A STATI DI CONNESSIONE
// ===================================================================================
// This implements the complex pairing dance between the devices.
// The logic is asymmetric:
// - The GUN acts as a "Beacon" (Master) and broadcasts packets across various channels.
// - The DONGLE and PEDAL act as "Listeners" (Slaves) in Promiscuous Mode.
// Once discovered, they exchange MAC addresses (to switch from insecure broadcast
// to point-to-point Unicast communication) and USB information (Spoofing).
// /
// Questa è l'implementazione della complessa danza di accoppiamento tra i dispositivi.
// La logica è asimmetrica: 
// - La GUN fa da "Faro" (Master) e spara pacchetti in broadcast sui vari canali.
// - Il DONGLE e il PEDAL fanno da "Ascoltatori" (Slave) in Promiscuous Mode.
// Una volta trovati, si scambiano i MAC Address (per passare dall'insicuro broadcast 
// a una comunicazione Unicast punto-a-punto) e le informazioni USB (Spoofing).

// ============ NUOVA IMPLEMNTAZIONE DONGLE == LA GUN FA IL FARO ================================
#ifdef DONGLE
bool SerialWireless_::connection_dongle() {
    
