alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  #if defined(DONGLE) && defined(USES_DISPLAY)
  TaskHandle_t animTaskHandleLink = NULL;  
  if(display_init) {
  // Avvio animazione
    if (animTaskHandleLink == NULL) {
      xTaskCreatePinnedToCore(
        animTaskLink,          // task function / funzione del task
        "AnimTaskLink",        // name / nome
        4096,              // stack size
        NULL,              // parameters / parametri
        1,                 // priority / priorità
        &animTaskHandleLink,   // handle
        APP_CPU_NUM        // core (you can use 0 or 1) / (puoi usare 0 o 1)
      );
    }
  }
  #endif // USES_DISPLAY

  #define TIMEOUT_DONGLE_DIALOGUE 2000 // in milliseconds / in millisecondi
  unsigned long lastMillis_start_dialogue = millis ();
  
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    
  // ====================================================
  
  // WAITING FOR THE BEACON / ATTESA DEL FARO
  // The dongle opens the ports to accept broadcast packets from the gun.
  // /
  // Il Dongle apre le porte per accettare i pacchetti Broadcast della Gun
  broadcast_receiver = true;

  while(stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) { 
    if (stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
      lastMillis_start_dialogue = millis ();
    }
    // Security Timeout: If the Gun disappears mid-handshake, we reset the state. / Timeout di Sicurezza: Se la Gun sparisce a metà handshake, resettiamo lo stato
    if (((millis() - lastMillis_start_dialogue) > TIMEOUT_DONGLE_DIALOGUE) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
      stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    }
    taskYIELD();
  }
  
  // UNICAST LOCK-IN
  // Connection established. Closing broadcast ports for security and to
  // reduce CPU load from processing stray packets.
  // /
  // Connessione stabilita. Chiudiamo le porte al broadcast per sicurezza e per 
  // alleggerire il carico CPU sulla ricezione di pacchetti vaganti.
  broadcast_receiver = false;

  //Serial.println("DONGLE - Negotiation complete - pairing GUN/DONGLE devices");
  //Serial.println("DONGLE - Negosazione completata - associazione dei dispositivi GUN/DONGLE");
  if (esp_now_del_peer(peerAddress) != ESP_OK) {  // remove the broadcast from the peers / cancella il broadcast dai peer
    //Serial.println("DONGLE - Error deleting broadcast peer");
    //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
  }
  
  // We register the Gun as the only valid peer for communication. / Registriamo la Gun come unico peer valido per la comunicazione
  memcpy(peerAddress, mac_esp_another_card, 6);
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // adds the dongle to the peers / inserisce il dongle nei peer
    //Serial.println("DONGLE - Error adding the new GUN peer");
    //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);

  
  TinyUSBDevices.onBattery = true;
  
    #if defined(DONGLE) && defined(USES_DISPLAY)
      if (animTaskHandleLink != NULL) {
        vTaskDelete(animTaskHandleLink);
        animTaskHandleLink = NULL;
      }
    #endif // USES_DISPLAY
  
  return true; 
}
#endif // DONGLE
// ============ END OF NEW DONGLE IMPLEMENTATION == LAGANN ACTS AS A BEACON / FINE NUOVA IMPLEMNTAZIONE DONGLE == LA GUN FA IL FARO ================================

// ===================================================================================
// FAST RECOVERY / RICONNESSIONE RAPIDA (FAST RECOVERY)
// ===================================================================================
// Functions used to resume communication without repeating the entire
// slow handshake procedure. If the devices already know each other's
// MAC addresses (e.g., saved in EEPROM/Flash in the future), they "knock"
// directly on the specific port.
// /
// Funzioni utilizzate per riprendere la comunicazione senza dover rifare tutta
// la lenta procedura di Handshake. Se i dispositivi conoscono già i rispettivi 
// MAC Address (es. salvati in EEPROM/Flash in futuro), "bussano" direttamente 
// alla porta specifica.

#ifdef GUN
bool SerialWireless_::connection_gun_at_last_dongle() {
  #define TIMEOUT_TX_PACKET_LAST_DONGLE 300 // in milliseconds - Packet transmission interval in milliseconds, resulting in 4–5 packets./ in millisecondi - tempo di invio pacchetti ogni millisecondi quindi 4-5 pacchetti
  #define TIMEOUT_DIALOGUE_LAST_DONGLE 2000 // in milliseconds - Maximum time to search for the last dongle / in millisecondi - tempo massimo per ricerca ultimo dongle
  unsigned long lastMillis_tx_packet_last_dongle = 0;
  unsigned long lastMillis_start_dialogue_last_dongle = millis ();

  uint8_t aux_buffer_tx[13];
  
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION_DONGLE;
  aux_buffer_tx[0] = CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_DONGLE;
  memcpy(&aux_buffer_tx[1], SerialWireless.mac_esp_inteface, 6);
  memcpy(&aux_buffer_tx[7], peerAddress, 6);
  while (!TinyUSBDevice.mounted() && 
         (stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_DONGLE) &&
         ((millis() - lastMillis_start_dialogue_last_dongle) < TIMEOUT_DIALOGUE_LAST_DONGLE)) { 
      if ((millis() - lastMillis_tx_packet_last_dongle) > TIMEOUT_TX_PACKET_LAST_DONGLE)
      {
        SerialWireless.SendPacket((const uint8_t *)aux_buffer_tx, 13, PACKET_TX::CHECK_CONNECTION_LAST_DONGLE); 
        lastMillis_tx_packet_last_dongle = millis();
      }
      
      taskYIELD();
  }
  if (stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_DONGLE) {    
    stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
    TinyUSBDevices.onBattery = true;
    return true;
  } else {
    // Fast Recovery failure: preparing for a Full Handshake. / Fallimento Fast Recovery: prepariamo il terreno per il Full Handshake.
    stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    lastDongleSave=false;
    esp_now_deinit();
    begin();
    return false;
  }
}
#endif // GUN

#ifdef GUN
bool SerialWireless_::connection_gun_at_last_pedal() {
  #define TIMEOUT_TX_PACKET_LAST_PEDAL 300 // in milliseconds - Packet transmission interval in milliseconds, resulting in 4–5 packets./ in millisecondi - tempo di invio pacchetti ogni millisecondi quindi 4-5 pacchetti
  #define TIMEOUT_DIALOGUE_LAST_PEDAL 2000 // in milliseconds - Maximum time to search for the last dongle / in millisecondi - tempo massimo per ricerca ultimo pedal
  unsigned long lastMillis_tx_packet_last_pedal = 0;
  unsigned long lastMillis_start_dialogue_last_pedal = millis ();
  uint8_t aux_buffer_tx[13];
  
  // =============================================
  uint8_t peerAddress_copy[6]; 
  memcpy(peerAddress_copy, peerAddress, 6);

  memcpy(peerAddress, lastPedalAddress, 6);        
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  peerInfo.channel = espnow_wifi_channel;
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserts the dongle into the peers / inserisce il dongle nei peer
    //Serial.println("Error adding the new peer");
    //Serial.println("Errore nell'aggiunta del nuovo peer");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);         
  // =============================================

  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION_PEDAL;
  aux_buffer_tx[0] = CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_PEDAL;
  memcpy(&aux_buffer_tx[1], SerialWireless.mac_esp_inteface, 6);
  memcpy(&aux_buffer_tx[7], peerAddress, 6);
  while ((stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_PEDAL) &&
         ((millis() - lastMillis_start_dialogue_last_pedal) < TIMEOUT_DIALOGUE_LAST_PEDAL)) { 
      if ((millis() - lastMillis_tx_packet_last_pedal) > TIMEOUT_TX_PACKET_LAST_PEDAL)
      {
        SerialWireless.SendPacket((const uint8_t *)aux_buffer_tx, 13, PACKET_TX::CHECK_CONNECTION_LAST_PEDAL); 
        lastMillis_tx_packet_last_pedal = millis();
      }
      
      taskYIELD();
  }
  
