alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  if (esp_now_del_peer(peerAddress) != ESP_OK) {  // remove the broadcast from the peers / cancella il broadcast dai peer
      //Serial.println("DONGLE - Error removing the peer broadcast");
      //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
  }

  memcpy(peerAddress, peerAddress_copy, 6);

  if (stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_PEDAL) {    
    //stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
    
    memcpy(peerAddress_pedal, lastPedalAddress, 6);
    memcpy(peerInfo.peer_addr, peerAddress_pedal, 6);
    peerInfo.channel = espnow_wifi_channel;
    if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserts the dongle into the peers / inserisce il dongle nei peer
      //Serial.println("DONGLE - Error adding the new GUN peer");
      //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
    } else esp_now_set_peer_rate_config(peerAddress_pedal, &rate_config);

    setupTimerPedal();  // Create the timer to safely manage the pedal / CREA IL TIMER PER GESTIRE IN SICUREZZA IL PEDA

    
    TinyUSBDevices.is_pedal_wireless = true;

    return true;
  } else {
    //stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    TinyUSBDevices.is_pedal_wireless = false;
    
    lastPedalSave=false;
    return false;
  }
}
#endif // GUN

// ===================================================================================
// MASTER SIDE (GUN): COMPLETE HANDSHAKE PROCEDURE
// /
// LATO MASTER (GUN): PROCEDURA COMPLETA DI HANDSHAKE
// ===================================================================================

// ======================= IMPLEMENTATION WHERE THE GUN IS THE BEACON. / NUOVA IMPLEMENTAZIONE DOVE LA GUN FA IL FARO ===============
#ifdef GUN
bool SerialWireless_::connection_gun() {
  
  channel_display = espnow_wifi_channel;

  #if defined(GUN) && defined(USES_DISPLAY)
  TaskHandle_t animTaskHandleLink = NULL;  
  if(display_OLED != nullptr) {
  // Avvio animazione
    if (animTaskHandleLink == NULL) {
      xTaskCreatePinnedToCore(
        animTaskLink,          // task function / funzione del task
        "AnimTaskLink",        // name / nome
        4096,              // stack size
        NULL,              // parameters / parametri
        1,                 // priority / priorità
        &animTaskHandleLink,   // handle
        APP_CPU_NUM        // core (you can use 0 or 1) / (puoi usare 0 o 1)
      );
    }
  }
  #endif // USES_DISPLAY
  
  
  uint8_t channel = espnow_wifi_channel;   // between 1 and 13 (14 should be reserved) / tra e 1 e 13 (il 14 dovrebbe essere riservato)
  #define TIMEOUT_GUN_TX_PACKET 80  // 500 // in milliseconds / in millisecondi
  #define TIMEOUT_GUN_CHANGE_CHANNEL 250  // 2000 // in milliseconds - changes channel every / in millisecondi - cambia canale ogni
  #define TIMEOUT_GUN_DIALOGUE 3000  //  6000 // in milliseconds - maximum time to complete the pairing operation / in millisecondi - tempo massimo per completare operazione accoppiamento
  unsigned long lastMillis_tx_packet = millis ();
  unsigned long lastMillis_change_channel = millis ();
  unsigned long lastMillis_start_dialogue = millis ();
  uint8_t aux_buffer_tx[14]; // added a byte to also transmit the transmission channel 
                             // when transmitting the presence advertisement packet, the channel is also included
                             // /
                             // aggiunto un byte per trasmettere anche il canale di trasmissione
                             // durante tx pacchetto pubblicazione presenza, mette anche il canale
  
 

  // ===== IMPOSTARE IL PEER BOARCAST ===============
  if (esp_now_del_peer(peerAddress) != ESP_OK) {  // remove the broadcast from the peers / cancella il broadcast dai peer
    //Serial.println("Error deleting peer");
    //Serial.println("Errore nella cancellazione del peer");
  }
  memcpy(peerAddress, BROADCAST_ADDR, 6);
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserts the dongle into the peers / inserisce il dongle nei peer
    //Serial.println("Error adding the new peer");
    //Serial.println("Errore nell'aggiunta del nuovo peer");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);                       
  // ====================================================
  
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
  aux_buffer_tx[0] = CONNECTION_STATE::TX_GUN_SEARCH_DONGLE_BROADCAST;
  memcpy(&aux_buffer_tx[1], SerialWireless.mac_esp_inteface, 6);
  memcpy(&aux_buffer_tx[7], peerAddress, 6);
 
  broadcast_receiver = true;

  // SEARCH LOOP (CHANNEL HOPPING) / LOOP DI RICERCA (CHANNEL HOPPING)
  // The Gun physically changes the WiFi channel every TIMEOUT_GUN_CHANGE_CHANNEL (250ms)
  // and transmits beacon packets (80ms). If it receives a response, it transitions to the next state.
  // /
  // La Gun cambia fisicamente il canale WiFi ogni TIMEOUT_GUN_CHANGE_CHANNEL (250ms)
  // e spara pacchetti beacon (80ms). Se riceve risposta passa allo stato successivo.
  while (!TinyUSBDevice.mounted() && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
    if (stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
      if (((millis() - lastMillis_change_channel) > TIMEOUT_GUN_CHANGE_CHANNEL) && 
         ((millis() - lastMillis_tx_packet)) >= (TIMEOUT_GUN_TX_PACKET - 50)) {  // Added a 50 ms margin to prevent a random channel switch immediately after sending a packet, which would otherwise leave no time for a response. / aggiunta impostato 50 ms come margine, per evitare che quando invia pacchetto cambi subito casnale senza dare possibilità risposta
        aux_buffer_tx[13] = channel;
        channel_display = channel;      
        
        esp_wifi_set_promiscuous(true);
        if (esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE) != ESP_OK) {
          //Serial.printf("DONGLE - esp_wifi_set_channel failed!");
        }
        esp_wifi_set_promiscuous(false);
        peerInfo.channel = channel;
        if (esp_now_mod_peer(&peerInfo) != ESP_OK) {  // modify the peer's channel / modifica il canale del peer
          //Serial.println("DONGLE - Error changing channel");
          //Serial.println("DONGLE - Errore nella modifica del canale");
        }             
        lastMillis_change_channel = millis ();
        lastMillis_tx_packet = 0;
        
