alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
        channel++;
        if (channel >13) channel = 1;// to send a packet immediately on the new channel / per fare inviare subito un pacchetto sul nuovo canale
      }
      if ((millis() - lastMillis_tx_packet) > TIMEOUT_GUN_TX_PACKET) {
        SerialWireless.SendPacket((const uint8_t *)aux_buffer_tx, 14, PACKET_TX::CONNECTION); // added a byte to also transmit the transmission channel / aggiunto un byte per trasmettere anche il canale di trasmissione
        //Serial.print("DONGLE - broadcast packet sent on channel: ");
        //Serial.print("DONGLE - inviato pacchetto broadcast sul canale: ");
        //Serial.println(channel);
        lastMillis_tx_packet = millis (); 
      }
      lastMillis_start_dialogue = millis();
    }
    else {
      // Timeout if the handshake stalls midway / Timeout se l'handshake si blocca a metà
      if (((millis() - lastMillis_start_dialogue) > TIMEOUT_GUN_DIALOGUE) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
        stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
        //Serial.println("DONGLE - Negotiation between DONGLE/GUN did not complete; restarting from the beginning");
        //Serial.println("DONGLE - Non si è conclusa la negoziazione tra DONGLE/GUN e si riparte da capo");
        lastMillis_change_channel = millis ();
      }  
    }
    taskYIELD();
  }

  broadcast_receiver = false;  

  if (stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED) {
    //Serial.println("DONGLE - Negotiation complete - pairing GUN/DONGLE devices");
    //Serial.println("DONGLE - Negosazione completata - associazione dei dispositivi GUN/DONGLE");
    if (esp_now_del_peer(peerAddress) != ESP_OK) {  // remove the broadcast from the peers / cancella il broadcast dai peer
      //Serial.println("DONGLE - Error deleting broadcast peer");
      //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
    }
    memcpy(peerAddress, mac_esp_another_card, 6);
    memcpy(peerInfo.peer_addr, peerAddress, 6);
    espnow_wifi_channel=usb_data_wireless.channel;
    esp_wifi_set_promiscuous(true);
    esp_wifi_set_channel(espnow_wifi_channel, WIFI_SECOND_CHAN_NONE);
    esp_wifi_set_promiscuous(false);
    peerInfo.channel = espnow_wifi_channel;
    if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserts the dongle into the peers / inserisce il dongle nei peer
      //Serial.println("DONGLE - Error adding the new GUN peer");
      //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
    } else esp_now_set_peer_rate_config(peerAddress, &rate_config);



    #if defined(GUN) && defined(USES_DISPLAY)
      if (animTaskHandleLink != NULL) {
        vTaskDelete(animTaskHandleLink);
        animTaskHandleLink = NULL;
      }
    #endif // USES_DISPLAY


    TinyUSBDevices.onBattery = true;
    return true;  
  }
  
  #if defined(GUN) && defined(USES_DISPLAY)
    if (animTaskHandleLink != NULL) {
      vTaskDelete(animTaskHandleLink);
      animTaskHandleLink = NULL;
    }
  #endif // USES_DISPLAY

  return false; 

}
#endif // GUN
// ======================= END IMPLEMENTATION WHERE THE GUN IS THE BEACON. / FINE NUOVA IMPLEMENTAZIONE DOVE LA GUN FA IL FARO ===============
// ============ Packet transmission to the pedal connection dongle completed. / INVIO PACCHETTO AL DONGLE DI CONNESSIONE AL PEDAL COMPLETATA =============================
#ifdef GUN
void SerialWireless_::tx_gun_at_dongle_pedal_ready() {
  for (uint8_t i=0; i<3; i++) {
    SerialWireless.SendPacket((const uint8_t *)&TinyUSBDevices.is_pedal_wireless, 1, PACKET_TX::PEDAL_TX);
    vTaskDelay(pdMS_TO_TICKS(69));
  }
}
#endif // GUN
// ============ END Packet transmission to the pedal connection dongle completed. / INVIO PACCHETTO AL DONGLE DI CONNESSIONE AL PEDAL COMPLETATA =============================
// ======================= NEW IMPLEMENTATION WHERE THE GUN IS THE BEACON to connect to the pedal / NUOVA IMPLEMENTAZIONE DOVE LA GUN FA IL FARO per connetersi al pedal ===============
#ifdef GUN
bool SerialWireless_::connection_gun_at_pedal() {
  
  uint8_t seconds = MAX_SECONDI_CONNESSIONE_PEDAL;  //10; 
  seconds_display = seconds;

  channel_display = espnow_wifi_channel;

  #if defined(GUN) && defined(USES_DISPLAY)
  TaskHandle_t animTaskHandleLink_pedal = NULL;  
  if(display_OLED != nullptr) {
  // Avvio animazione
    if (animTaskHandleLink_pedal == NULL) {
      xTaskCreatePinnedToCore(
        animTaskLink_pedal,          // task function / funzione del task
        "AnimTaskLink_pedal",        // name / nome
        4096,              // stack size
        NULL,              // parameters / parametri
        1,                 // priority / priorità
        &animTaskHandleLink_pedal,   // handle
        APP_CPU_NUM        // core (you can use 0 or 1) / (puoi usare 0 o 1)
      );
    }
  }
  #endif // USES_DISPLAY
  
  
  #define TIMEOUT_GUN_AT_PEDAL_TX_PACKET 50 //500 // in milliseconds / in millisecondi
  #define TIMEOUT_GUN_AT_PEDAL_CHANGE_SECONDS 1000 // in milliseconds = 1 second / in millisecondi =  1 secondo
  #define TIMEOUT_GUN_AT_PEDAL_DIALOGUE 3000 //6000 // in milliseconds - maximum time to complete pairing operation / in millisecondi - tempo massimo per completare operazione accoppiamento
  unsigned long lastMillis_tx_packet = millis ();
  unsigned long lastMillis_change_seconds = millis ();
  unsigned long lastMillis_start_dialogue = millis ();
  uint8_t aux_buffer_tx[14]; // added a byte to also broadcast the broadcast channel 
                             // during tx presence publication package, also puts the channel
                             // /
                             // aggiunto un byte per trasmettere anche il canale di trasmissione
                             // durante tx pacchetto pubblicazione presenza, mette anche il canale
  uint8_t peerAddress_copy[6];
  
  
  memcpy(peerAddress_copy, peerAddress, 6);

  memcpy(peerAddress, BROADCAST_ADDR, 6);        
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  peerInfo.channel = espnow_wifi_channel;
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserts the dongle into the peers / inserisce il dongle nei peer
    //Serial.println("Error adding the new peer");
    //Serial.println("Errore nell'aggiunta del nuovo peer");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);                       
  // ====================================================
  
