alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
  aux_buffer_tx[0] = CONNECTION_STATE::TX_GUN_SEARCH_PEDAL_BROADCAST;
  memcpy(&aux_buffer_tx[1], SerialWireless.mac_esp_inteface, 6);
  memcpy(&aux_buffer_tx[7], peerAddress, 6);
  aux_buffer_tx[13] = espnow_wifi_channel;

  broadcast_receiver = true;
  
  while ( (seconds > 1) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
    if (stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
      if (((millis() - lastMillis_change_seconds) > TIMEOUT_GUN_AT_PEDAL_CHANGE_SECONDS) && 
         ((millis() - lastMillis_tx_packet)) >= (TIMEOUT_GUN_AT_PEDAL_TX_PACKET - 50)) {  // addition set 50 ms as a margin, to avoid that when sending a packet it immediately changes the channel without giving the possibility of a response / aggiunta impostato 50 ms come margine, per evitare che quando invia pacchetto cambi subito casnale senza dare possibilità risposta
        aux_buffer_tx[13] = espnow_wifi_channel;
        seconds_display = seconds;
                        
        lastMillis_change_seconds = millis ();
        lastMillis_tx_packet = 0;
        
        seconds--;
      }
      if ((millis() - lastMillis_tx_packet) > TIMEOUT_GUN_AT_PEDAL_TX_PACKET) {
        SerialWireless.SendPacket((const uint8_t *)aux_buffer_tx, 14, PACKET_TX::CONNECTION_PEDAL); // added a byte to also transmit the broadcast channel / aggiunto un byte per trasmettere anche il canale di trasmissione
        //Serial.print("GUN -> PEDAL - broadcast packet sent on channel: ");
        //Serial.print("GUN -> PEDAL - inviato pacchetto broadcast sul canale: ");
        //Serial.println(channel);
        lastMillis_tx_packet = millis (); 
      }
      lastMillis_start_dialogue = millis();
    }
    else {
      if (((millis() - lastMillis_start_dialogue) > TIMEOUT_GUN_AT_PEDAL_DIALOGUE) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
        stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
        //Serial.println("GUN - The negotiation between GUN/PEDAL was not concluded and we start again from scratch");
        //Serial.println("GUN - Non si è conclusa la negoziazione tra GUN/PEDAL e si riparte da capo");
        lastMillis_change_seconds = millis ();
      }  
    }
    taskYIELD();
  }
  
  broadcast_receiver = false;

  if (esp_now_del_peer(peerAddress) != ESP_OK) {  // remove the broadcast from the peers / cancella il broadcast dai peer
      //Serial.println("GUN - Error canceling peer broadcast");
      //Serial.println("GUN - Errore nella cancellazione del peer broadcast");
  }

  memcpy(peerAddress, peerAddress_copy, 6);

  // ================================
  // Force the pedal into the "alive" state by sending a fake signal
  // /
  // Forza al pedale lo stato "vivo" inviando un segnale fasullo
  SerialWireless.tx_gun_at_dongle_pedal_ready();
  /*
  for (uint8_t i=0; i<3; i++) {
    SerialWireless.SendPacket((const uint8_t *)&TinyUSBDevices.is_pedal_wireless, 1, PACKET_TX::PEDAL_TX);
    vTaskDelay(pdMS_TO_TICKS(69));
  }
  */
  // ================================

  if (stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED) {
    //Serial.println("DONGLE - Negotiation completed - pairing of GUN/DONGLE devices");
    //Serial.println("DONGLE - Negosazione completata - associazione dei dispositivi GUN/DONGLE");

    memcpy(peerAddress_pedal, mac_esp_another_card, 6);
    memcpy(peerInfo.peer_addr, peerAddress_pedal, 6);
    peerInfo.channel = espnow_wifi_channel;
    if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserts the dongle into the peers / inserisce il dongle nei peer
      //Serial.println("DONGLE - Error adding new GUN peer");
      //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
    } else esp_now_set_peer_rate_config(peerAddress_pedal, &rate_config);

    setupTimerPedal();  // CREATE THE TIMER TO SAFELY MANAGE THE PEDAL / CREA IL TIMER PER GESTIRE IN SICUREZZA IL PEDALE



    #if defined(GUN) && defined(USES_DISPLAY)
      if (animTaskHandleLink_pedal != NULL) {
        vTaskDelete(animTaskHandleLink_pedal);
        animTaskHandleLink_pedal = NULL;
      }
    #endif // USES_DISPLAY

    TinyUSBDevices.is_pedal_wireless = true;
    return true;  
  }
  
  #if defined(GUN) && defined(USES_DISPLAY)
    if (animTaskHandleLink_pedal != NULL) {
      vTaskDelete(animTaskHandleLink_pedal);
      animTaskHandleLink_pedal = NULL;
    }
  #endif // USES_DISPLAY

  TinyUSBDevices.is_pedal_wireless = false;
  return false; 

}
#endif // GUN
// ======================= END NEW IMPLEMENTATION WHERE THE GUN IS THE BEACON to connect to the pedal / FINE NUOVA IMPLEMENTAZIONE DOVE LA GUN FA IL FARO per connetersi al pedal ===============

// ======================= PEDAL IMPLEMENTATION - STAY LISTENING ON ALL CHANNELS / IMPLEMENTAZIONE PEDAL - RIMANE IN ASCOLTO SU TUTTI I CANALI ===============
#ifdef PEDAL
bool SerialWireless_::connection_pedal() {
  
    
  uint8_t channel = espnow_wifi_channel;   // between and 1 and 13 (14 should be reserved) / tra e 1 e 13 (il 14 dovrebbe essere riservato)
  
  #define TIMEOUT_PEDAL_CHANGE_CHANNEL 150 // 2000 // in milliseconds- change channel every / in millisecondi - cambia canale ogni
  #define TIMEOUT_PEDAL_DIALOGUE 3000 // 6000 // in milliseconds - maximum time to complete pairing operation / in millisecondi - tempo massimo per completare operazione accoppiamento
  unsigned long lastMillis_change_channel = millis ();
  unsigned long lastMillis_start_dialogue = millis ();
  
   
  
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
  
  broadcast_receiver = true;

  while (stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
    if (stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
      if (((millis() - lastMillis_change_channel) > TIMEOUT_PEDAL_CHANGE_CHANNEL)) { 
         
        esp_wifi_set_promiscuous(true);
        if (esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE) != ESP_OK) {
          //Serial.printf("DONGLE - esp_wifi_set_channel failed!");
        }
        esp_wifi_set_promiscuous(false);
        
        espnow_wifi_channel = channel;
        
        peerInfo.channel = channel;  // you could also always set it to 0 which uses the wifi one / si potrebbe anche impostare sempre a 0 che usa quello del wifi
        if (esp_now_mod_peer(&peerInfo) != ESP_OK) {  // modify the peer's channel / modifica il canale del peer
          //Serial.println("DONGLE - Error changing channel");
          //Serial.println("DONGLE - Errore nella modifica del canale");
        }             
        lastMillis_change_channel = millis ();
        
        
