alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
        channel++;
        if (channel >13) channel = 1;
      }
      
      lastMillis_start_dialogue = millis();
    }
    else {
      if (((millis() - lastMillis_start_dialogue) > TIMEOUT_PEDAL_DIALOGUE) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
        stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
        //Serial.println("DONGLE - Negotiation between DONGLE/GUN did not complete; restarting from the beginning");
        //Serial.println("DONGLE - Non si è conclusa la negoziazione tra DONGLE/GUN e si riparte da capo");
        lastMillis_change_channel = millis ();
      }  
    }
    taskYIELD();
  }
    
  broadcast_receiver = false;
    
    //Serial.println("DONGLE - Negotiation completed - pairing of GUN/DONGLE devices");
    //Serial.println("DONGLE - Negosazione completata - associazione dei dispositivi GUN/DONGLE");
    if (esp_now_del_peer(peerAddress) != ESP_OK) {  // remove the broadcast from the peers / cancella il broadcast dai peer
      //Serial.println("DONGLE - Error deleting peer broadcast");
      //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
    }
    memcpy(peerAddress, mac_esp_another_card, 6);
    memcpy(peerInfo.peer_addr, peerAddress, 6);
    espnow_wifi_channel=usb_data_wireless.channel;
    esp_wifi_set_promiscuous(true);
    esp_wifi_set_channel(espnow_wifi_channel, WIFI_SECOND_CHAN_NONE);
    esp_wifi_set_promiscuous(false);
    peerInfo.channel = espnow_wifi_channel;
    if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserts the dongle into the peers / inserisce il dongle nei peer
      //Serial.println("DONGLE - Error adding new GUN peer");
      //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
    } else esp_now_set_peer_rate_config(peerAddress, &rate_config);

  
    TinyUSBDevices.onBattery = true;
    return true;  
      
}
#endif // PEDAL
// ======================= END PEDAL IMPLEMENTATION - STAY LISTENING ON ALL CHANNELS / FINE IMPLEMENTAZIONE PEDAL - RIMANE IN ASCOLTO SU TUTTI I CANALI ===============

// ===================================================================================
// CALLBACK LEVEL: DECODING OF RECEIVED PACKETS / DECODIFICA DEI PACCHETTI RICEVUTI
// ===================================================================================
// This block contains the parsing brain. By target (#ifdef)
// packets are routed to different functions (e.g. the Dongle will send
// the HID Report to the PC, while the Gun will decode the Force Feedback to move the motors).
// Runs in a task (not interrupt) but still needs to be lightning fast.
// /
// Questo blocco contiene il cervello del parsing. In base al target (#ifdef)
// i pacchetti vengono smistati verso funzioni diverse (es. il Dongle invierà
// l'HID Report al PC, mentre la Gun decodificherà il Force Feedback per muovere i motori).
// Viene eseguito in un task (non in interrupt) ma deve comunque essere velocissimo.

// ======================= CALLBACK PACKET DONGLE =========================================
#ifdef DONGLE
void packet_callback_read_dongle() {
  switch (SerialWireless.packet.currentPacketID()) {
    case PACKET_TX::SERIAL_TX:
      Serial.write(&SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      Serial.flush();
      break;
    case PACKET_TX::MOUSE_TX : {
      uint8_t* ptr = &SerialWireless.packet.rxBuff[PREAMBLE_SIZE];
      if (memcmp(ptr, &absmouse5Report_last_wifi, sizeof(absmouse5Report_last_wifi))) {
        memcpy(&absmouse5Report_last_wifi, ptr, sizeof(absmouse5Report_last_wifi));
        absmouse5Report_pending = true;    
        xTaskNotifyGive(xUSBTaskHandle);
      }
      break;
    }
    case PACKET_TX::GAMEPADE_TX: {
      uint8_t* ptr = &SerialWireless.packet.rxBuff[PREAMBLE_SIZE];
      // --- GAMEPAD ---
      if (memcmp(ptr, &gamepad16Report_last_wifi, sizeof(gamepad16Report_last_wifi))) {
        memcpy(&gamepad16Report_last_wifi, ptr, sizeof(gamepad16Report_last_wifi));
        gamepad16Report_pending = true;
        xTaskNotifyGive(xUSBTaskHandle);
      }
      break;
    }
    case PACKET_TX::KEYBOARD_TX: {
      uint8_t* ptr = &SerialWireless.packet.rxBuff[PREAMBLE_SIZE];
      if (memcmp(ptr, &keyReport_last_wifi, sizeof(keyReport_last_wifi))) {
        memcpy(&keyReport_last_wifi, ptr, sizeof(keyReport_last_wifi));
        keyReport_pending = true;
        xTaskNotifyGive(xUSBTaskHandle);
      }
      break;
    }
    // ====== consider whether to change name or change implementation / valutare se cambiare nome o cambiare implementazione ================
    case PACKET_TX::PEDAL_TX:
      {
        SerialWireless.is_pedal_wireless_comunication = true;
      }
      break;
    // ============================================================================= 
    #ifdef OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    case PACKET_TX::MOUSE_KEY_PAD_TX: {
      
      // We calculate the base address ONCE and put it in the 'ptr' pointer / Calcoliamo l'indirizzo base UNA sola volta e lo mettiamo nel puntatore 'ptr'
      uint8_t* ptr = &SerialWireless.packet.rxBuff[PREAMBLE_SIZE];

      // --- MOUSE ---
      // We compare the buffer to the last known state / Confrontiamo il buffer con l'ultimo stato noto
      if (memcmp(ptr, &absmouse5Report_last_wifi, sizeof(absmouse5Report_last_wifi))) {
        memcpy(&absmouse5Report_last_wifi, ptr, sizeof(absmouse5Report_last_wifi));
        absmouse5Report_pending = true;    
      }   

      ptr += sizeof(absmouse5Report_last_wifi); // Slide the pointer forward to the end of the mouse data / Fai scorrere il puntatore in avanti alla fine dei dati mouse

      // --- KEYBOARD / TASTIERA ---
      if (memcmp(ptr, &keyReport_last_wifi, sizeof(keyReport_last_wifi))) {
        memcpy(&keyReport_last_wifi, ptr, sizeof(keyReport_last_wifi));
        keyReport_pending = true;
      }
      
      ptr += sizeof(keyReport_last_wifi); // Slide the pointer forward to the end of the keyboard data / Fai scorrere il puntatore in avanti alla fine dei dati tastiera

      // --- GAMEPAD ---
      if (memcmp(ptr, &gamepad16Report_last_wifi, sizeof(gamepad16Report_last_wifi))) {
        memcpy(&gamepad16Report_last_wifi, ptr, sizeof(gamepad16Report_last_wifi));
        gamepad16Report_pending = true;
      }
      
      if (absmouse5Report_pending || keyReport_pending || gamepad16Report_pending) xTaskNotifyGive(xUSBTaskHandle);

      break;  
    } // Case panel lock / Chiusura del blocco del case
    #endif // OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    case PACKET_TX::CHECK_CONNECTION_LAST_DONGLE:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      switch (aux_buffer[0])
      {
      case CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_DONGLE:
        if ((memcmp(&aux_buffer[1],peerAddress,6) == 0) && 
           (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
           SerialWireless.stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED) { 
              aux_buffer[0] = CONNECTION_STATE::TX_CONFERM_CONNECTION_LAST_DONGLE; 
              memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
              memcpy(&aux_buffer[7], peerAddress, 6);
              
              // ARCHITECTURAL ISSUE: / CRITICITA' ARCHITETTURALE:
              // The Dongle must send 3 consecutive acknowledgments, but
              // must not perform any other actions in the meantime to ensure clean pairing. 
              // Consider whether to send the packet a couple of times or just once;
              // it sends it 3 times—once every 70ms.
              // /
              // Il Dongle deve inviare 3 conferme consecutive, ma
              // nel frattempo non deve fare nient'altro per assicurare l'accoppiamento pulito.
              // valutare se inviarlo un paio di volte il pacchetto o solo una volta
              // lo invia 3 volte - una volta ogni 70ms
              for (uint8_t i = 0; i<3; i++) {
                if (i>0) {
                  vTaskDelay(pdMS_TO_TICKS(69)); // equivalent to delay(1000) but non-blocking on ESP32 / equivalente a delay(1000) ma non bloccante su esp32
                  //unsigned long lastMillis_tx_packet_connection_last_dongle = millis();
                  //while ((millis() - lastMillis_tx_packet_connection_last_dongle) < 70) taskYIELD(); ///////yield(); 
                }
                SerialWireless.SendPacket((const uint8_t *)aux_buffer, 13, PACKET_TX::CHECK_CONNECTION_LAST_DONGLE);
              }
        }
        break;
      default:
        break;
      }     
      break;
    case PACKET_TX::CONNECTION:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead); //sizeof(aux_buffer));
      //Serial.println("DONGLE - connection request received");
      //Serial.println("DONGLE - arrivato richiesta di connessione");
      switch (aux_buffer[0]) {
        case CONNECTION_STATE::TX_GUN_SEARCH_DONGLE_BROADCAST:
          if ((SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) &&
              (aux_buffer[13] == espnow_wifi_channel))
          { // takes the first available gun / prende la prima gun disposnibile
            memcpy(SerialWireless.mac_esp_another_card, &aux_buffer[1], 6);
            // send connection request / invia richiesta connessione
            aux_buffer[0] = CONNECTION_STATE::TX_DONGLE_TO_GUN_PRESENCE;
            memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
            memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
            aux_buffer[13] = espnow_wifi_channel;
            SerialWireless.SendPacket((const uint8_t *)aux_buffer, 14, PACKET_TX::CONNECTION);
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::TX_DONGLE_TO_GUN_PRESENCE;
            // ensure that the data has been sent / assicurati che i dati siano stati spediti

