alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
          }
          break;
        case CONNECTION_STATE::TX_GUN_TO_DONGLE_ACCEPT:
          if ((memcmp(&aux_buffer[1],SerialWireless.mac_esp_another_card,6) == 0) && 
             (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
              SerialWireless.stato_connessione_wireless == CONNECTION_STATE::TX_DONGLE_TO_GUN_PRESENCE) {
              
              // Save data related to the gun VID, PID, player, etc. (USB spoofing) / SALVA I DATI RELATIVI ALLA GUN VID, PID, PLAYER , ECC.ECC. (USB Spoofing)
              memcpy(&usb_data_wireless, &aux_buffer[13], sizeof(usb_data_wireless));
              
              aux_buffer[0] = CONNECTION_STATE::TX_DONGLE_TO_GUN_CONFERM;
              memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
              memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
                            
              // =========================================================
              // Send the final package multiple times. / INVIARE IL PACCHETTO FINALE PIU' VOLTE  
              // =========================================================
              for (uint8_t i = 0; i<3; i++) {
                if (i>0) {
                  vTaskDelay(pdMS_TO_TICKS(69)); // equivalent to delay(1000) but non-blocking on ESP32 / equivalente a delay(1000) ma non bloccante su esp32
                  //unsigned long lastMillis_tx_packet_gun_to_dongle_conferm = millis();
                  //while ((millis() - lastMillis_tx_packet_gun_to_dongle_conferm) < 70) taskYIELD(); /////yield(); 
                }
                SerialWireless.SendPacket((const uint8_t *)aux_buffer, 13, PACKET_TX::CONNECTION);
              }
              SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
          }
          break;          
        default:
          break;
      }
      break;  
    default:
      break;
  }
}
#endif // DONGLE
// ======================= FINE CALLBACK PACKET DONGLE =========================================

// ======================= CALLBACK PACKET GUN =========================================
#ifdef GUN
void packet_callback_read_gun() {
  switch (SerialWireless.packet.currentPacketID()) {
    case PACKET_TX::SERIAL_TX:
      SerialWireless.write_on_rx_serialBuffer(&SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      break;
    case PACKET_TX::MOUSE_TX :
      /* code */
      break;
    case PACKET_TX::GAMEPADE_TX:
      /* code */
      break;
    case PACKET_TX::KEYBOARD_TX:
      /* code */  
      break;
    case PACKET_TX::PEDAL_TX:
      {
 
  // =====================================================
        
        // pedal active = 00000001 - pedal2 active = 00000010 - both pedals active = 00000011 - no pedals pressed = 00000000
        // pedal attivo = 00000001 - pedal2 attivo = 00000010 - entrambi pedali attivi = 00000011 - tutti i pedali non premuti = 00000000
        memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
        TinyUSBDevices.pedals_wireless_state = aux_buffer[0];
        esp_timer_stop(timer_handle_pedal); 
        if (TinyUSBDevices.pedals_wireless_state) esp_timer_start_once(timer_handle_pedal, MAX_TIMEOUT_LAST_PACKET);
      }
      break;
    case PACKET_TX::CHECK_CONNECTION_LAST_DONGLE:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      switch (aux_buffer[0])
      {
      case CONNECTION_STATE::TX_CONFERM_CONNECTION_LAST_DONGLE:
        if ((memcmp(&aux_buffer[1],peerAddress,6) == 0) && 
           (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
           SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION_DONGLE) { 
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_DONGLE;
        }
        break;
      default:
        break;
      }     
      break;
    case PACKET_TX::CHECK_CONNECTION_LAST_PEDAL:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      switch (aux_buffer[0])
      {
      case CONNECTION_STATE::TX_CONFERM_CONNECTION_LAST_PEDAL:
        if ((memcmp(&aux_buffer[1],peerAddress,6) == 0) && 
           (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
           SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION_PEDAL) { 
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_PEDAL;
        }
        break;
      default:
        break;
      }     
      break;
    case PACKET_TX::CONNECTION:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead); //13); //sizeof(aux_buffer)); // 13 is also fine here for the data to be copied / qui va bene anche 13 come dati da copiare
      switch (aux_buffer[0]) {
        // With the first packet, the dongle also transmits the channel to prevent the cycle from advancing and the channel... / AL PRIMO PACCHETTO IL DONGLE TRASMETTE ANCHE IL CANALE PER EVITARE CHE NEL FRATTEMPO IL CICLO VADA AVANTI ED IL CANALE 
        case CONNECTION_STATE::TX_DONGLE_TO_GUN_PRESENCE:
          if ((memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) && SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
            memcpy(SerialWireless.mac_esp_another_card, &aux_buffer[1], 6);
            usb_data_wireless.channel= aux_buffer[13];
            aux_buffer[0] = CONNECTION_STATE::TX_GUN_TO_DONGLE_ACCEPT;
            memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
            memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
            // Also sends data related to the gun's VID, PID, etc. / INVIA ANCHE DATI RELATIVI A VID, PID, ECC,ECC, DELLA GUN
            memcpy(&aux_buffer[13], &usb_data_wireless, sizeof(usb_data_wireless));
            SerialWireless.SendPacket((const uint8_t *)aux_buffer, sizeof(aux_buffer), PACKET_TX::CONNECTION);
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::TX_GUN_TO_DONGLE_ACCEPT;
          }
          break;
        case CONNECTION_STATE::TX_DONGLE_TO_GUN_CONFERM:
          if ((memcmp(&aux_buffer[1],SerialWireless.mac_esp_another_card,6) == 0) && 
             (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
             SerialWireless.stato_connessione_wireless == CONNECTION_STATE::TX_GUN_TO_DONGLE_ACCEPT) {           
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
        }
          break;
        default:
          break;
      }
      break;
    case PACKET_TX::CONNECTION_PEDAL:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead); //13); //sizeof(aux_buffer)); // 13 is also fine here for the data to be copied / qui va bene anche 13 come dati da copiare
      switch (aux_buffer[0]) {
        // With the first packet, the dongle also transmits the channel to prevent the cycle from advancing and the channel... / AL PRIMO PACCHETTO IL DONGLE TRASMETTE ANCHE IL CANALE PER EVITARE CHE NEL FRATTEMPO IL CICLO VADA AVANTI ED IL CANALE 
        case CONNECTION_STATE::TX_PEDAL_TO_GUN_PRESENCE:
          if ((memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) && SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
            memcpy(SerialWireless.mac_esp_another_card, &aux_buffer[1], 6);
            usb_data_wireless.channel= espnow_wifi_channel;  // shouldn't be necessary / non dovrebbe servire
            aux_buffer[0] = CONNECTION_STATE::TX_GUN_TO_PEDAL_ACCEPT;
            memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
            memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
            // Also sends data related to the gun's VID, PID, etc. / INVIA ANCHE DATI RELATIVI A VID, PID, ECC,ECC, DELLA GUN
            memcpy(&aux_buffer[13], &usb_data_wireless, sizeof(usb_data_wireless));
            SerialWireless.SendPacket((const uint8_t *)aux_buffer, sizeof(aux_buffer), PACKET_TX::CONNECTION_PEDAL);
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::TX_GUN_TO_PEDAL_ACCEPT;
          }
          break;
        case CONNECTION_STATE::TX_PEDAL_TO_GUN_CONFERM:
          if ((memcmp(&aux_buffer[1],SerialWireless.mac_esp_another_card,6) == 0) && 
             (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
             SerialWireless.stato_connessione_wireless == CONNECTION_STATE::TX_GUN_TO_PEDAL_ACCEPT) {           
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
        }
          break;
        default:
          break;
      }
      break;
    default:
      break;
  }
}
#endif // GUN
// ======================= END CALLBACK PACKET GUN / FINE CALLBACK PACKET GUN =========================================

