alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
// ======================= CALLBACK PACKET PEDAL =========================================
#ifdef PEDAL
void packet_callback_read_pedal() {
  switch (SerialWireless.packet.currentPacketID()) {
    case PACKET_TX::SERIAL_TX:
      break;
    case PACKET_TX::MOUSE_TX :
      break;
    case PACKET_TX::GAMEPADE_TX:
      break;
    case PACKET_TX::KEYBOARD_TX:
      break;
    #ifdef OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    case PACKET_TX::MOUSE_KEY_PAD_TX: { 
      break;  
    } 
    #endif // OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    case PACKET_TX::CHECK_CONNECTION_LAST_PEDAL:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      switch (aux_buffer[0])
      {
      case CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_PEDAL:
        if ((memcmp(&aux_buffer[1],peerAddress,6) == 0) && 
           (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
           SerialWireless.stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED) { 
              aux_buffer[0] = CONNECTION_STATE::TX_CONFERM_CONNECTION_LAST_PEDAL; 
              memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
              memcpy(&aux_buffer[7], peerAddress, 6);
              // consider whether to send the packet a couple of times or just once / valutare se inviarlo un paio di volte il pacchetto o solo una volta
              // sends it 3 times – once every 70ms / lo invia 3 volte - una volta ogni 70ms
              for (uint8_t i = 0; i<3; i++) {
                if (i>0) {
                  vTaskDelay(pdMS_TO_TICKS(69)); // equivalent to delay(1000) but non-blocking on ESP32 / equivalente a delay(1000) ma non bloccante su esp32
                  //unsigned long lastMillis_tx_packet_connection_last_pedal = millis();
                  //while ((millis() - lastMillis_tx_packet_connection_last_pedal) < 70) taskYIELD();  ////yield(); 
                }
                SerialWireless.SendPacket((const uint8_t *)aux_buffer, 13, PACKET_TX::CHECK_CONNECTION_LAST_PEDAL);
              }
        }
        break;
      default:
        break;
      }     
      break;
    case PACKET_TX::CONNECTION_PEDAL:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead); //sizeof(aux_buffer));
      //Serial.println("DONGLE - connection request received");
      //Serial.println("DONGLE - arrivato richiesta di connessione");
      switch (aux_buffer[0]) {
        case CONNECTION_STATE::TX_GUN_SEARCH_PEDAL_BROADCAST:
          if ((SerialWireless.stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) &&
              (aux_buffer[13] == espnow_wifi_channel))  // system espnow_wifi_channel / sistema espnow_wifi_channel
          { // takes the first available gun / prende la prima gun disposnibile
            memcpy(SerialWireless.mac_esp_another_card, &aux_buffer[1], 6);
            // send connection request / invia richiesta connessione
            aux_buffer[0] = CONNECTION_STATE::TX_PEDAL_TO_GUN_PRESENCE;
            memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
            memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
            SerialWireless.SendPacket((const uint8_t *)aux_buffer, 13, PACKET_TX::CONNECTION_PEDAL);
            SerialWireless.stato_connessione_wireless = CONNECTION_STATE::TX_PEDAL_TO_GUN_PRESENCE;
            // ensure that the data has been sent / assicurati che i dati siano stati spediti

          }
          break;
        case CONNECTION_STATE::TX_GUN_TO_PEDAL_ACCEPT:
          if ((memcmp(&aux_buffer[1],SerialWireless.mac_esp_another_card,6) == 0) && 
             (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
              SerialWireless.stato_connessione_wireless == CONNECTION_STATE::TX_PEDAL_TO_GUN_PRESENCE) {
              
                // Save data related to the gun (VID, PID, player, etc.) / SALVA I DATI RELATIVI ALLA GUN VID, PID, PLAYER , ECC.ECC.
              memcpy(&usb_data_wireless, &aux_buffer[13], sizeof(usb_data_wireless));
              
              aux_buffer[0] = CONNECTION_STATE::TX_PEDAL_TO_GUN_CONFERM;
              memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
              memcpy(&aux_buffer[7], SerialWireless.mac_esp_another_card, 6);
                            
              // =========================================================
              // Send the final package multiple times. / INVIARE IL PACCHETTO FINALE PIU' VOLTE  
              // =========================================================
              for (uint8_t i = 0; i<3; i++) {
                if (i>0) {
                  vTaskDelay(pdMS_TO_TICKS(69)); // equivalent to delay(1000) but non-blocking on ESP32 / equivalente a delay(1000) ma non bloccante su esp32
                  //unsigned long lastMillis_tx_packet_gun_to_pedal_conferm = millis();
                  //while ((millis() - lastMillis_tx_packet_gun_to_pedal_conferm) < 70) taskYIELD();  ////yield(); 
                }
                SerialWireless.SendPacket((const uint8_t *)aux_buffer, 13, PACKET_TX::CONNECTION_PEDAL);
              }
              SerialWireless.stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
          }
          break;          
        default:
          break;
      }
      break;  
    default:
      break;
  }
}
#endif // PEDAL
// ======================= FINE CALLBACK PACKET PEDAL =========================================

// ===================================================================================
// LOW-LEVEL ESP-NOW INTERRUPT (ISR)
// ===================================================================================
// These two functions are executed directly by the WiFi subsystem (FreeRTOS ISR).
// It is strictly forbidden to use blocking functions or semaphores within them.
// /
// Queste due funzioni sono eseguite direttamente dal sottosistema WiFi (FreeRTOS ISR).
// È assolutamente vietato usare funzioni bloccanti o semafori al loro interno.

// =================== ESP-NOW Receive and Send Callbacks / CALLBACK DI RICEZIONE ED INVIO DI ESP-NOW ========================

// CALLBACK RICEZIONE ESP-NOW
static void _esp_now_rx_cb(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
  
