alessandro-satanassi/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  // // Broadcast filter / Filtro broadcast
  if ((info->des_addr[0] == 0xFF) && (broadcast_receiver == false)) return;

  // Local index cache (The heart of Lock-Free) / Cache locale degli indici (Il cuore del Lock-Free)
  uint16_t w = SerialWireless._writer;
  uint16_t r = SerialWireless._reader; // Let's see where the task is located right now. / Leggiamo dove si trova il task in questo istante
  const uint16_t MASK = FIFO_SIZE_READ - 1; 

  // Mathematical calculation of available space (Minus-One Rule)
  // This magic formula handles the wrap-around automatically and ensures that the
  // buffer never becomes 100% full, always leaving a 1-byte buffer
  // to distinguish the "empty" state from the "full" state.
  // /
  // Calcolo matematico dello spazio disponibile (Regola del Meno Uno)
  // Questa formula magica gestisce il wrap-around da sola e garantisce che il 
  // buffer non diventi mai pieno al 100%, lasciando sempre 1 byte di cuscinetto
  // per distinguere lo stato "vuoto" da quello "pieno".
  uint16_t free_space = (r - w - 1) & MASK;

  // Capacity check / Controllo capienza
  if (free_space >= len) {
    uint16_t firstChunk = FIFO_SIZE_READ - w;

    // BATCH COPY / COPIA BATCH
    if (firstChunk < len) {
      // Line break case: we need to split the copy in two. / Caso a capo: dobbiamo dividere la copia in due
      uint16_t secondChunk = len - firstChunk;
      memcpy(SerialWireless._queue + w, data, firstChunk);
      memcpy(SerialWireless._queue, data + firstChunk, secondChunk);
    } 
    else {
      // Linear case: single copy / Caso lineare: copia singola
      memcpy(SerialWireless._queue + w, data, len);
    }

    // --- MEMORY BARRIER / BARRIERA DI MEMORIA ---
    // Crucial: ensures that RAM has saved the memcpy data
    // BEFORE signaling to the task that new data is available.
    // /
    // Fondamentale: garantisce che la RAM abbia salvato i dati della memcpy 
    // PRIMA di segnalare al task che ci sono nuovi dati disponibili.
    asm volatile ("memw" : : : "memory");

    // ATOMIC update of the _writer index only
    // No lock required! As soon as this line executes,
    // the task (watching _writer) magically sees the new data appear.
    // /
    // Aggiornamento ATOMICO del solo indice _writer
    // Nessun lock necessario! Appena questa riga viene eseguita, 
    // il task (che sta guardando _writer) vede magicamente apparire i nuovi dati.
    SerialWireless._writer = (w + len) & MASK;   
    
  } 
  else {
    // Insufficient space (or packet discarded to avoid pointer crossing)
    // Spazio insufficiente (o pacchetto scartato per evitare l'incrocio dei puntatori)
    SerialWireless._overflow_read = true;
  }
  
  // Task Notification (Bell icon unchanged)
  // Notifica Task (Campanello invariato)
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  vTaskNotifyGiveFromISR(xRadioTaskHandle, &xHigherPriorityTaskWoken);
  if (xHigherPriorityTaskWoken) {
    portYIELD_FROM_ISR();
  }
}

// ESP-NOW SEND CALLBACK / CALLBACK SPEDIZIONE ESP-NOW
static void _esp_now_tx_cb(const esp_now_send_info_t *tx_info, esp_now_send_status_t status) { 
  // Let's free up the radio for the next packet. / Liberiamo la radio per il prossimo pacchetto
  radioFree = true;

  // Lock-free check: Does the TX buffer still have data to send? / Controllo Lock-Free: Il buffer TX ha ancora dati da spedire?
  if (SerialWireless.writeIndex != SerialWireless.readIndex) {   
    
    // Let's wake up the radioTask to have it empty the rest. / Svegliamo il radioTask per fargli svuotare il resto
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    vTaskNotifyGiveFromISR(xRadioTaskHandle, &xHigherPriorityTaskWoken);
    
    if (xHigherPriorityTaskWoken) {
      portYIELD_FROM_ISR();
    }
  }
}
// =================== END ESP-NOW Receive and Send Callbacks / FINE CALLBACK DI RICEZIONE ED INVIO DI ESP-NOW ========================


// ===================================================================================
// HARDWARE TIMERS (SERIAL AND PEDAL) / (SERIALE E PEDALE)
// ===================================================================================
// Using esp_timer (high-resolution hardware timer) instead of delay() or millis()
// ensures precise, high-priority execution—essential for unblocking a
// congested serial connection or declaring a pedal "dead" if packets are lost.
// /
// L'uso di esp_timer (alta risoluzione hardware) invece di delay() o millis() 
// garantisce un'esecuzione prioritaria e precisa, essenziale per sbloccare la 
// seriale intasata o per dichiarare un pedale "morto" se si perdono pacchetti.

// ================================== Serial Port Timer / TIMER PER SERIALE ===================================
// CALLBACK per timer Serial

void timer_callback_serial(void* arg) {
  while (SerialWireless.availableBufferSerialWrite() > 0) {
    if (!SerialWireless.flush_sem()) {
      // The radio is full! The timer cannot yield. 
      // We ask the radioTask for help for when space becomes available.
      // /
      // LA RADIO È PIENA! Il timer non può fare yield.
      // Chiediamo aiuto al radioTask per quando si libererà spazio.
      SerialWireless._serial_needs_recovery = true; 
      break; 
    }
  }
}

void SerialWireless_::setupTimerSerial() {
    esp_timer_create_args_t timer_args = {
        .callback = &timer_callback_serial,
        .arg = NULL,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "timer_serial"
    };
    
    esp_timer_create(&timer_args, &timer_handle_serial);
}


// ==========================   END Serial Port Timer / FINE TIMER PER SERIALE ====================================


// ================================== PEDAL TIMER / TIMER PER PEDAL ===================================
// CALLBACK per timer Pedal
void timer_callback_pedal(void* arg) {
  
  TinyUSBDevices.pedals_wireless_state = 0;
 
}

void setupTimerPedal() {
    esp_timer_create_args_t timer_args = {
        .callback = &timer_callback_pedal,
        .arg = NULL,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "timer_pedal"
    };
    
    esp_timer_create(&timer_args, &timer_handle_pedal);
}
// ======================== END PEDAL TIMER / FINE TIMER PER PEDAL =============================

// ===================================================================================
// SYSTEM CALLBACK: TINYUSB / CALLBACK DI SISTEMA: TINYUSB
// ===================================================================================

// ============ TinyUSB Send Callback / CALLBACK PER SPEDIZIONE TINYUSB =============================
#ifdef DONGLE
// It does not need to be defined, as it replaces the default one that does nothing (it is already defined within the tinyUSB library)
// /
// NON VA DEFINITA IN QUANTO SOSTITUISCE QUELLA DI DEFAULT CHE NON FA NULLA (e' gia' definita dentro la libreria tinyUSB)
#ifdef __cplusplus
extern "C" {
#endif

// This callback is invoked by the low-level USB driver whenever
// the PC "consumes" the HID data sent by the Dongle. We intercept it to
// wake up the usbTask and immediately send the next packet.
// /
// Questa callback viene invocata dal driver USB a basso livello ogni volta che 
// il PC "assorbe" i dati HID inviati dal Dongle. Noi la intercettiamo per
// risvegliare l'usbTask e inviare immediatamente il pacchetto successivo.
void tud_hid_report_complete_cb(uint8_t instance, uint8_t const* report, uint16_t len) {
    // The PC has just freed the buffer. Let's wake up usbTask! / Il PC ha appena liberato il buffer. Svegliamo usbTask!
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    vTaskNotifyGiveFromISR(xUSBTaskHandle, &xHigherPriorityTaskWoken);
    if (xHigherPriorityTaskWoken) {
        portYIELD_FROM_ISR();
    }
}

#ifdef __cplusplus
}
#endif

#endif // DONGLE
// ============ END TinyUSB Send Callback / FINE CALLBACK PER SPEDIZIONE TINYUSB =============================


#endif //OPENFIRE_WIRELESS_ENABLE